Repository: pypi-data/pypi-mirror-385
Catalog: packages/Flask-Security-Invenio/flask_security_invenio-3.8.2-py2.py3-none-any.whl/flask_security/translations/*/LC_MESSAGES/flask_security.po
Languages: fi

source: Login Required
fi: Kirjautuminen vaaditaan

source: Welcome
fi: Tervetuloa

source: Please confirm your email
fi: Vahvista sähköpostiosoitteesi

source: Your password has been reset
fi: Salasanasi on nollattu

source: Your password has been changed
fi: Salasanasi on vaihdettu

source: Password reset instructions
fi: Ohjeet salasanan palauttamiseen

source: You do not have permission to view this resource.
fi: Sinulla ei ole oikeuksia tarkastella tätä resurssia.

source: Thank you. Confirmation instructions have been sent to %(email)s.
fi: Kiitos. Vahvistusohjeet on lähetetty osoitteeseen %(email)s.

source: Thank you. Your email has been confirmed.
fi: Kiitos. Sähköpostiosoitteesi on vahvistettu.

source: Your email has already been confirmed.
fi: Sähköpostiosoitteesi on jo vahvistettu.

source: Invalid confirmation token.
fi: Virheellinen vahvistustunnus.

source: %(email)s is already associated with an account.
fi: %(email)s on jo liitetty käyttäjätiliin.

source: Password does not match
fi: Salasana ei täsmää

source: Passwords do not match
fi: Salasanat eivät täsmää

source: Redirections outside the domain are forbidden
fi: Uudelleenohjaukset toimialueen ulkopuolelle ovat kiellettyjä

source: Instructions to reset your password have been sent to %(email)s.
fi: Ohjeet salasanan palauttamiseksi on lähetetty osoitteeseen %(email)s.

source: You did not reset your password within %(within)s. New instructions have been sent to %(email)s.
fi: Et palauttanut salasanaasi ajassa %(within)s. Uudet ohjeet on lähetetty osoitteeseen %(email)s.

source: Invalid reset password token.
fi: Virheellinen salasanan palautustunnus.

source: Email requires confirmation.
fi: Sähköpostiosoite vaatii vahvistuksen.

source: Confirmation instructions have been sent to %(email)s.
fi: Vahvistusohjeet on lähetetty osoitteeseen %(email)s.

source: You did not confirm your email within %(within)s. New instructions to confirm your email have been sent to %(email)s.
fi: Et vahvistanut sähköpostiasi ajassa %(within)s. Uudet vahvistusohjeet on lähetetty osoitteeseen %(email)s.

source: You did not login within %(within)s. New instructions to login have been sent to %(email)s.
fi: Et kirjautunut sisään ajassa %(within)s. Uudet kirjautumisohjeet on lähetetty osoitteeseen %(email)s.

source: Instructions to login have been sent to %(email)s.
fi: Kirjautumisohjeet on lähetetty osoitteeseen %(email)s.

source: Invalid login token.
fi: Virheellinen kirjautumistunnus.

source: Account is disabled.
fi: Tili on poistettu käytöstä.

source: Email not provided
fi: Sähköpostiosoitetta ei annettu

source: Invalid email address
fi: Virheellinen sähköpostiosoite

source: Password not provided
fi: Salasanaa ei annettu

source: No password is set for this user
fi: Tälle käyttäjälle ei ole asetettu salasanaa

source: Password must be at least 6 characters
fi: Salasanan on oltava vähintään 6 merkkiä

source: Specified user does not exist
fi: Määritettyä käyttäjää ei ole olemassa

source: Invalid password
fi: Virheellinen salasana

source: Forgot password?
fi: Unohditko salasanan?

source: You successfully reset your password and you have been logged in automatically.
fi: Palautit salasanasi onnistuneesti ja sinut kirjattiin sisään automaattisesti.

source: Your new password must be different than your previous password.
fi: Uuden salasanan on oltava eri kuin aiempi salasanasi.

source: You successfully changed your password.
fi: Vaihdoit salasanasi onnistuneesti.

source: Please log in to access this page.
fi: Kirjaudu sisään päästäksesi tälle sivulle.

source: Please reauthenticate to access this page.
fi: Vahvista henkilöllisyytesi uudelleen päästäksesi tälle sivulle.

source: Email Address
fi: Sähköpostiosoite

source: Password
fi: Salasana

source: Login
fi: Kirjaudu

source: Register
fi: Rekisteröi

source: Resend Confirmation Instructions
fi: Lähetä vahvistusohjeet uudelleen

source: Recover Password
fi: Palauta salasana

source: Reset Password
fi: Nollaa salasana

source: Retype Password
fi: Kirjoita salasana uudelleen

source: New Password
fi: Uusi salasana

source: Change Password
fi: Vaihda salasana

source: Menu
fi: Valikko

source: Forgot password
fi: Unohtunut salasana

source: Confirm account
fi: Vahvista tili

source: Change password
fi: Vaihda salasana

source: Send password reset instructions
fi: Lähetä salasanan palautusohjeet

source: Reset password
fi: Nollaa salasana

source: Resend confirmation instructions
fi: Lähetä vahvistusohjeet uudelleen

source: Your password has been changed.
fi: Salasanasi on vaihdettu.

source: If you did not change your password,
fi: Jos et vaihtanut salasanaasi,

source: click here to reset it
fi: klikkaa tästä palauttaaksesi sen

source: Please confirm your email through the link below:
fi: Vahvista sähköpostiosoitteesi alla olevan linkin kautta:

source: Confirm my account
fi: Vahvista tilini

source: Click here to reset your password
fi: Klikkaa tästä nollataksesi salasanasi

source: Welcome %(email)s!
fi: Tervetuloa %(email)s!

source: You can confirm your email through the link below:
fi: Voit vahvistaa sähköpostiosoitteesi alla olevan linkin kautta:
