Repository: pypi-data/pypi-mirror-385
Catalog: packages/pyams-security-views/pyams_security_views-2.4.1-py3-none-any.whl/pyams_security_views/locales/*/LC_MESSAGES/pyams_security_views.po
Languages: fr

source: No selected principal
fr: Aucun mandataire sélectionné

source: Notifications settings
fr: Paramétrage des notifications

source: Notifications are used to send messages to users during their registration process. Applications can also send messages during their normal process.
fr: Les notifications sont utilisées pour envoyer des messages aux utilisateurs. Elles sont notamment nécessaires pour prendre en charge leur processus d'enregistrement, aussi bien lorsqu'il s'agit d'une inscription publique (si vous activez cette option) que dans le cadre d'un enregistrement par un administrateur. Les applications peuvent également envoyer des messages dans le cadre de leur processus de fonctionnement normal.

source: CORS configuration
fr: Configuration CORS

source: If you disable CORS origins check, any CORS request will be accepted. Otherwise, only origins specified below will be allowed. Please note that you don't have to set main site URL(s) below, only "external" URLs have to be defined.
fr: Si vous désactivez le contrôle sur l'origine des requêtes, toutes les requêtes CORS seront acceptées ! Dans le cas contraire, seules les requêtes dont l'origine est indiquée ci-dessous seront acceptées. Veuillez noter que vous n'avez pas à indiquer l'URL d'accès au site, celle-ci sera toujours acceptée ; seules les origines "externes" doivent être précisées.

source: User roles
fr: Habilitations

source: Granted object roles
fr: Rôles accordés aux utilisateurs

source: Roles are not defined for this context!
fr: Aucun rôle n'est défini dans ce contexte !

source: Security policy
fr: Politique de sécurité

source: Security policy management
fr: Paramètres de la politique de sécurité

source: security-manager-menu
fr: Sécurité

source: Security
fr: Sécurité

source: Security plug-ins
fr: Modules de sécurité

source: List of security plug-ins
fr: Liste des modules de sécurité

source: Search into folder
fr: Rechercher dans le dossier

source: Plug-in is enabled
fr: Plug-in actif

source: Security manager
fr: Gestionnaire de sécurité

source: Properties
fr: Propriétés

source: Security modules
fr: Modules de la politique de sécurité

source: Management interface
fr: Interface d'administration

source: Login form
fr: Écran de connexion

source: Login form configuration
fr: Configuration de l'écran de connexion

source: Form properties
fr: Propriétés du formulaire

source: Open registration can be used when you want external users to be able to freely register their user account. You then have to select the users folder into which their profile will be stored. THIS CAN BE DANGEROUS! You should enable this feature carefully...
fr: L'inscription libre peut être utilisée lorsque vous souhaitez que des utilisateurs externes à votre service puissent s'enregistrer librement. Vous devez dans ce cas sélectionner le dossier dédié dans lequel seront stockés leurs profils utilisateurs. ATTENTION : cette option peut être dangereuse et ne doit donc être activée qu'avec précaution ! Vous devez notamment vous assurer qu'aucune permission importante n'a été accordée aux utilisateurs authentifiés...

source: Inherited roles
fr: Autres rôles hérités

source: Add groups folder...
fr: Ajouter un dossier de groupes...

source: Title
fr: Nom

source: List of folder groups
fr: Groupes d'utilisateurs

source: Add group
fr: Ajouter un groupe

source: New local group
fr: Nouveau groupe d'utilisateurs

source: New local group properties
fr: Propriétés du nouveau groupe

source: Specified login is already used.
fr: Le login indiqué est déjà utilisé.

source: Group: {}
fr: Groupe : {}

source: Group properties
fr: Propriétés du groupe

source: New plug-in: {}
fr: Nouveau module : {}

source: New plug-in properties
fr: Propriétés du nouveau module

source: Specified prefix is already used!
fr: Le préfixe indiqué est déjà utilisé !

source: Plug-in properties
fr: Propriétés du module

source: Plug-in: {}
fr: Module : {}

source: Add admin authentication...
fr: Ajouter un utilisateur système...

source: Warning!
fr: ATTENTION !

source: Before disabling plug-in, you should verify that you have other administration access!
fr: Avant de désactiver ce compte, vérifiez bien que vous disposez d'au moins un autre accès administrateur !

source: <strong>Be careful to redefine the password when using some browsers which are forcing autocompletion!!!</strong><br />Clearing the password will keep the plug-in active but without the option to log-in with this account; setting the password value to '*****' will leave the password as-is...
fr: <strong>Prenez soin de bien redéfinir le mot de passe lorsque vous utilisez certains navigateurs qui forcent l'auto-complétion !!!</strong><br />En effaçant le mot de passe, le compte restera actif mais sans possibilité de se connecter (il restera utilisable pour des tâches internes) ; en indiquant la valeur '*****', le mot de passe ne sera pas modifié...

source: Add local users folder...
fr: Ajouter un dossier d'utilisateurs locaux...

source: Users search form
fr: Rechercher des utilisateurs

source: Login
fr: Identifiant

source: Mail address
fr: Adresse de messagerie

source: Account has password set
fr: Le mot de passe est renseigné

source: Account is activated
fr: Le profil est activé

source: Search results
fr: Résultats de la recherche

source: Add user
fr: Ajouter un utilisateur

source: New local user
fr: Nouvel utilisateur

source: New local user properties
fr: Propriétés du nouvel utilisateur

source: User password was not confirmed correctly.
fr: Le mot de passe n'a pas été confirmé correctement.

source: New user was created successfully!
fr: Le compte utilisateur a été créé avec succès !

source: Change password
fr: Modifier le mot de passe

source: Refresh secret
fr: Réinitialiser le secret

source: Enable
fr: Activer

source: Disable
fr: Désactiver

source: User: {}
fr: Utilisateur : {}

source: User properties
fr: Propriétés de l'utilisateur

source: Refresh activation secret and send a new activation link to this user
fr: Génère une nouvelle clé d'activation qui sera envoyée à l'utilisateur

source: Re-enable user profile
fr: Ré-activer le compte

source: Disable user profile temporarily will forbid login with this account...
fr: Désactiver ce compte utilisateur empêchera toute connexion jusqu'à sa réactivation...

source: This profile has been deactivated!<br /> A new activation code has been created and sent to this user!
fr: Le compte a été désactivé !<br />Un nouveau lien d'activation a été créé et transmis à l'utilisateur...

source: Enabled user!
fr: Compte activé !

source: User has been enabled and can now log-in!
fr: Le compte utilisateur a été activé et peut maintenant être utilisé pour se connecter !

source: Disabled user!
fr: Compte désactivé !

source: User has been disabled and can't log in anymore!
fr: Le compte utilisateur a été désactivé et ne peut plus être utilisé pour se connecter...

source: Change user password
fr: Modifier le mot de passe

source: Login skin
fr: Thème graphique

source: This is the skin applied to the login screen
fr: Thème graphique appliqué à l'écran de connexion ; si vous choisissez l'option "PyAMS: skin MyAMS", c'est le thème graphique paramétré par défaut dans la configuration de la ZMI qui sera appliqué

source: Login logo
fr: Logo de connexion

source: Image used in login form
fr: Image affichée dans le formulaire de connexion

source: Login header
fr: Chapô

source: This text will be displayed in login page header
fr: Ce texte sera affiché au-dessus du formulaire de connexion

source: Header renderer
fr: Mode de rendu

source: Text renderer used for the header
fr: Vous pouvez sélectionner le mode de rendu utilisé pour le chapô

source: Login footer
fr: Pied de page

source: This text will be displayed in login page footer
fr: Ce texte sera affiché en-dessous du formulaire de connexion

source: Footer renderer
fr: Mode de rendu

source: Text renderer used for the footer
fr: Vous pouvez sélectionner le mode de rendu utilisé pour le pied de page

source: Enable free registration?
fr: Autoriser l'inscription libre

source: If 'Yes', any use will be able to create a new user account
fr: Si 'oui', toute personne visitant le site sera à même de s'enregistrer et de faire une demande de création de compte utilisateur

source: Users folder
fr: Dossier d'utilisateurs

source: Name of users folder used to store registered principals
fr: Nom du module utilisé pour identifier les utilisateurs qui se seront enregistrés

source: Activation delay
fr: Délai d'activation

source: This is the maximum delay, in days, until which unactivated user profiles are automatically deleted
fr: Cette durée indiquée en jours indique le délai maximum dont dispose un utilisateur entre l'inscription de son profil et son activation complète avant que ce dernier ne soit entièrement supprimé

source: You can't activate open registration without selecting a users folder
fr: Vous ne pouvez pas activer les fonctions d'inscription libre sans sélectionner un dossier de stockage des utilisateurs concernés

source: Allow password reset
fr: Permettre la réinitialisation du mot de passe

source: If 'Yes', users will be able reset their password
fr: Si 'oui', les utilisateurs auront la possibilité de réinitialiser leur mot de passe en cas d'oubli

source: Redirection hash
fr: Hash de redirection

source: User ID
fr: Identifiant

source: Your user ID can be your email address or a custom login
fr: Votre identifiant peut être votre adresse de messagerie ou un code utilisateur spécifique

source: Password
fr: Mot de passe

source: Register
fr: Inscription

source: Reset password
fr: Mot de passe oublié

source: Connect
fr: Connexion

source: Reset
fr: Annuler

source: Cancel
fr: Annuler

source: Please enter valid credentials
fr: Paramètres de connexion

source: You must authenticate
fr: Vous devez vous authentifier !

source: Missing security manager utility. Please contact your system administrator!
fr: Aucun gestionnaire de sécurité n'est disponible. Veuillez contacter votre administrateur !

source: Invalid credentials!
fr: Vos paramètres de connexion sont incorrects !
