Repository: pypi-data/pypi-mirror-385
Catalog: packages/flowstrider/flowstrider-1.1.0.tar.gz/flowstrider-1.1.0/src/flowstrider/localization/linddun/*/LC_MESSAGES/linddun.po
Languages: de

source: If data is stored for a longer time than necessary it poses a privacy risk in case of a data breach. For example, storing email addresses of newsletter subscribers long after they have unsubscribed.
de: Werden Daten länger als nötig gespeichert, stellt dies im Falle eines Datenlecks ein Datenschutzrisiko dar. Beispielsweise wenn E-Mail-Adressen von Newsletter-Abonnenten lange nach deren Abmeldung gespeichert werden.

source: Evaluate your storage policies. Consider how long you store personal data and whether you have a process to remove data you no longer need.
de: Überprüfung der Speicherrichtlinien. Evaluierung, wie lange personenbezogene Daten gespeichert werden sollen und ob ein Prozess zum Löschen nicht mehr benötigter Daten existiert.

source: Overexposure of Personal Data
de: Übermäßige Offenlegung personenbezogener Daten

source: Personal data is shared with more services or external parties than necessary
de: Personenbezogene Daten werden an mehr Dienste oder externe Parteien weitergegeben als nötig.

source: For personal data it should be considered to only send it to recipients who need it, to not involve unnecessary parties and keep the accessibility as low as possible. For example, medical data should not be made publicly available and location data from a navigation application should not be propagated to the calender or mail. Overexposure of personal data may lead to unintended consequences, as others could reuse the data for unforeseen purposes.
de: Bei personenbezogenen Daten sollte darauf geachtet werden, diese nur an die Empfänger zu senden, die sie benötigen, unnötige Dritte auszuschließen und die Zugänglichkeit so gering wie möglich zu halten. Beispielsweise sollten medizinische Daten nicht öffentlich zugänglich gemacht und Standortdaten aus Navigationsanwendungen nicht an Kalender oder E-Mail weitergegeben werden. Eine übermäßige Offenlegung personenbezogener Daten kann unbeabsichtigte Folgen haben, da andere die Daten für unvorhergesehene Zwecke verwenden könnten.

source: Carefully assess the necessity of sharing personal data and ensure that the involved parties genuinely require access to that data.
de: Prüfen Sie sorgfältig, ob die Weitergabe personenbezogener Daten erforderlich ist, und stellen Sie sicher, dass die beteiligten Parteien tatsächlich Zugriff auf diese Daten benötigen.

source: Insufficient Transparency
de: Unzureichende Transparenz

source: Data subjects are insufficiently informed about the collection and processing of their personal data
de: Betroffene Personen werden unzureichend über die Erhebung und Verarbeitung ihrer personenbezogenen Daten informiert

source: Data subjects should be sufficiently informed about what kind of personal data is collected, the purposes and methods of involved processing and with whom the data is being shared in a clear and understandable way. For example, awareness about traffic cameras collecting facial images next to number plates. Insufficient transparency may lead to data subjects being unaware about the utilization of their personal data, influencing their right to privacy.
de: Betroffene Personen sollten ausreichend, klar und verständlich darüber informiert werden, welche personenbezogenen Daten erhoben werden, zu welchen Zwecken und mit welchen Methoden sie verarbeitet werden und an wen die Daten weitergegeben werden. Beispielsweise sollten sie sich darüber im Klaren sein, dass Verkehrskameras Gesichtsbilder neben Nummernschildern erfassen. Mangelnde Transparenz kann dazu führen, dass Betroffene sich der Verwendung ihrer personenbezogenen Daten nicht bewusst sind, was ihr Recht auf Privatsphäre beeinträchtigt.

source: Data subjects must also be informed on any indirect data collection, i.e. from third parties.
de: Betroffene müssen auch über jede indirekte Datenerhebung, d.h. über Dritte, informiert werden.

source: Insufficient Information when Sharing Data of Others
de: Unzureichende Informationen beim Teilen von Daten anderer

source: When sharing personal data of others, users are insufficiently informed about the further data processing
de: Bei der Weitergabe personenbezogener Daten anderer werden Nutzer unzureichend über die weitere Datenverarbeitung informiert.

source: Data subjects should be sufficiently informed about what kind of data of others is collected, the purposes and methods of involved processing and with whom the data is being shared in a clear and understandable way. For example, a user posting a picture on social media may not be aware that others in the picture are automatically tagged with a facial recognition system. Insufficient transparency means, users may not realize they are unintentionally sharing personal data of other individuals.
de: Betroffene Personen sollten ausreichend und klar und verständlich darüber informiert werden, welche Art von Daten anderer erhoben werden, zu welchen Zwecken und mit welchen Methoden die Daten verarbeitet werden und mit wem sie geteilt werden. Beispielsweise ist sich ein Nutzer, der ein Bild in sozialen Medien veröffentlicht, möglicherweise nicht bewusst, dass andere Personen auf dem Bild automatisch mit einem Gesichtserkennungssystem gekennzeichnet werden. Mangelnde Transparenz bedeutet, dass Nutzer möglicherweise nicht erkennen, dass sie unbeabsichtigt personenbezogene Daten anderer Personen weitergeben.

source: Data subjects must also be informed on any processing of personal data from others
de: Betroffene müssen auch über die Verarbeitung personenbezogener Daten durch Dritte informiert werden.

source: Insufficient Privacy Controls
de: Unzureichende Datenschutzkontrollen

source: Data subjects have insufficient controls to manage their preferences
de: Die betroffenen Personen haben unzureichende Kontrolle über die Verwaltung ihrer Präferenzen

source: Users should be given the option to configure what personal data is processed and for what purposes. They should also be able alter their preferences afterwards. Appropriate control mechanisms are required to record data subject preferences and keep track of how the data may be further processed.
de: Nutzer sollten die Möglichkeit haben, zu konfigurieren, welche personenbezogenen Daten zu welchen Zwecken verarbeitet werden. Sie sollten ihre Präferenzen auch nachträglich ändern können. Es bedarf geeigneter Kontrollmechanismen, um die Präferenzen der betroffenen Personen zu erfassen und die weitere Verarbeitung der Daten zu verfolgen.

source: Privacy-frendly settings should be the default.
de: Datenschutzfreundliche Einstellungen sollten die Standardeinstellung sein.

source: Nudging can raise awareness and induce more privacy-preserving behaviour.
de: Gewisse Anstöße können das Bewusstsein schärfen und zu einem datenschutzfreundlicheren Verhalten führen

source: Insufficient Access
de: Unzureichender Zugriff

source: Data subjects do not have access to their personal data
de: Betroffene Personen haben keinen Zugriff auf ihre personenbezogenen Daten

source: Users should be given the option to access their collected personal information through the system or a helpdesk. Lack of access may violate the legal rights of data subjects.
de: Nutzer sollten die Möglichkeit haben, über das System oder einen Helpdesk auf ihre gesammelten personenbezogenen Daten zuzugreifen. Ein fehlender Zugriff kann die Rechte der betroffenen Personen verletzen.

source: Enable the user to access their personal data. (The right to access is not always absolute. Limitations may exist depending on applicable laws (e.g., trade secrets, rights of other data subjects))
de: Ermöglichen Sie dem Nutzer den Zugriff auf seine personenbezogenen Daten. (Das Zugriffsrecht ist nicht immer uneingeschränkt. Je nach geltendem Recht können Einschränkungen bestehen (z.B. Geschäftsgeheimnisse, Rechte anderer betroffener Personen.))

source: Insufficient Rectification or Erasure
de: Unzureichende Berichtigung oder Löschung

source: Data subjects cannot rectify or erase their personal data
de: Betroffene Personen können ihre personenbezogenen Daten weder berichtigen noch löschen

source: Users should be given the option to correct or delete their collected personal data. For example, when a user deletes his social media account, the data should be deleted and not just the account disabled.
de: Nutzer sollten die Möglichkeit haben, ihre gesammelten personenbezogenen Daten zu korrigieren oder zu löschen. Wenn ein Nutzer beispielsweise sein Social-Media-Konto löscht, sollten die Daten gelöscht und nicht nur das Konto deaktiviert werden.

source: Enable the user to correct or delete their personal data. (Rectification or erasure can also be performed indirectly (e.g., through a customer service ticket))
de: Ermöglichen Sie dem Nutzer, seine personenbezogenen Daten zu korrigieren oder zu löschen. (Die Korrektur oder Löschung kann auch indirekt erfolgen (z.B. über ein Kunden-Serviceticket.))

source: Non-Compliance of Processing with Applicable Regulations
de: Nichteinhaltung der geltenden Vorschriften bei der Verarbeitung

source: The processing of personal data by the system is not compliant with applicable privacy regulations
de: Die Verarbeitung personenbezogener Daten durch das System entspricht nicht den geltenden Datenschutzbestimmungen

source: Processing and sharing of personal information must adhere to jurisdictions in regions it is used in. For example, the system must not process information of EU citizens without a valid legal ground under GDPR.
de: Die Verarbeitung und Weitergabe personenbezogener Daten muss den geltenden Rechtsvorschriften der jeweiligen Regionen entsprechen. Beispielsweise darf das System keine Daten von EU-Bürgern ohne gültige Rechtsgrundlage gemäß der DSGVO verarbeiten.

source: Before processing any personal data, perform an assessment on the applicable regulations for your processing activities and system
de: Bevor personenbezogene Daten verarbeitet werden, sollten geltenden Vorschriften für die Verarbeitungstätigkeiten und das System geprüft werden.

source: Non-Adherence to Privacy Standards
de: Nichteinhaltung von Datenschutzstandards

source: The system is not compliant with privacy standards and best practices
de: Das System entspricht nicht den Datenschutzstandards und bewährten Verfahren

source: The system should adhere to (industry) specific privacy standards and implement them adequately. Non-adherence to industry standards and best practices makes it more difficult to demonstrate compliance with applicable laws.
de: Das System sollte (branchenspezifische) Datenschutzstandards einhalten und diese angemessen umsetzen. Die Nichteinhaltung von Branchenstandards und bewährten Verfahren erschwert den Nachweis der Einhaltung geltender Gesetze.

source: Check whether there is industry-specific guidance on data processing for your sector (e.g., healthcare, manufacturing)
de: Prüfen Sie, ob es branchenspezifische Leitlinien zur Datenverarbeitung für Ihren Sektor gibt (z.B. Gesundheitswesen, Fertigung).

source: Improper Data Lifecycle Management
de: Unsachgemäßes Datenlebenszyklusmanagement

source: Data is not properly managed throughout its entire lifecycle within the system
de: Daten werden während ihres gesamten Lebenszyklus im System nicht ordnungsgemäß verwaltet.

source: There should be a data lifecycle management policy defined for the data processed within the system. The policy should outline clear principles for each phase of the lifecycle (creation, storage, sharing, usage, archival, destruction). Improper data lifecycle management can result in a loss of overview of the data within the system and its maintanance, posing concerns not only for privacy and data protection but also security and availability.
de: Für die im System verarbeiteten Daten sollte eine Richtlinie für das Datenlebenszyklusmanagement definiert sein. Diese Richtlinie sollte klare Grundsätze für jede Phase des Lebenszyklus festlegen (Erstellung, Speicherung, Freigabe, Nutzung, Archivierung und Vernichtung). Unsachgemäßes Datenlebenszyklusmanagement kann dazu führen, dass der Überblick über die Daten im System und deren Pflege verloren geht. Dies wirft nicht nur Bedenken hinsichtlich Privatsphäre und Datenschutz, sondern auch hinsichtlich Sicherheit und Verfügbarkeit auf.

source: Data lifecycle management is a continuous process that must be consistently carried out as long as the system is designed, developed, and used
de: Datenlebenszyklusmanagement ist ein kontinuierlicher Prozess, der während der gesamten Systemkonzeption, -entwicklung und -nutzung konsequent durchgeführt werden muss.

source: Insufficient Security of Processing
de: Unzureichende Sicherheit der Verarbeitung

source: Data security measures and processes do not adhere to risk and security management best practices and standards
de: Datensicherheitsmaßnahmen und -prozesse entsprechen nicht den Best Practices und Standards des Risiko- und Sicherheitsmanagements.

source: There should be a process established to manage security risks and identify required countermeasures. The system should then incorporate the required countermeasures while regarding industry standards and best practices.
de: Es sollte ein Prozess zur Bewältigung von Sicherheitsrisiken und zur Ermittlung erforderlicher Gegenmaßnahmen etabliert werden. Das System sollte dann die erforderlichen Gegenmaßnahmen unter Berücksichtigung von Branchenstandards und bewährten Verfahren integrieren.

source: Consider complementary methods like security threat modeling
de: Erwägung von ergänzenden Methoden wie die Modellierung von Sicherheitsbedrohungen

source: LINDDUN rule collection
de: LINDDUN Regelsammlung
