Repository: pypi-data/pypi-mirror-385
Catalog: packages/flowstrider/flowstrider-1.1.0.tar.gz/flowstrider-1.1.0/src/flowstrider/localization/linddun/*/LC_MESSAGES/linddun.po
Languages: de

source: Linked User Requests
de: Verknüpfte Benutzeranfragen

source: User requests can be linked because they contain a unique identifier
de: Benutzeranfragen können verknüpft werden, da sie eine eindeutige Kennung enthalten

source: A unique identifier means different requests/data can be linked to a singular user profile or a specific group. Unique identifiers can exist globally or locally, within the system or across the context boundary. Examples: IP address or email address. Even if the identifier does not reveal one's identity directly, accumulated amounts of personal data can lead to 'identifying' threats.
de: Eine eindeutige Kennung ermöglicht die Zuordnung verschiedener Anfragen/Daten zu einem einzelnen Nutzerprofil oder einer bestimmten Gruppe. Eindeutige Kennungen können global oder lokal, systemintern oder kontextübergreifend existieren. Beispiele: IP-Adresse oder E-Mail-Adresse. Auch wenn die Kennung die Identität nicht direkt preisgibt, können akkumulierte personenbezogene Daten zu 'identifizierungs'-Bedrohungen führen.

source: LINDDUN card ID:
de: LINDDUN Karten ID:

source: Remove unique identifiers
de: Eindeutige Kennungen entfernen

source: Linkable User Requests Through Combination
de: Verknüpfbare Benutzeranfragen durch Kombination

source: User requests can be linked because they contain attributes that can be combined into quasi-identifiers
de: Nutzeranfragen können verknüpft werden, da sie Attribute enthalten, die zu Quasi-Identifikatoren kombiniert werden können.

source: Many requests contain a lot of different properties that, when combined, pose quasi-identifiers enabling the linking to unique individuals or groups. Examples for these properties: OS, browser, display size, language. Even if the properties do not reveal one's identity directly, accumulated amounts of personal data can lead to 'identifying' threats.
de: Viele Anfragen enthalten zahlreiche verschiedene Eigenschaften, die in Kombination Quasi-Identifikatoren darstellen und so die Zuordnung zu einzelnen Personen oder Gruppen ermöglichen. Beispiele für diese Eigenschaften: Betriebssystem, Browser, Bildschirmgröße und Sprache. Auch wenn die Eigenschaften die Identität nicht direkt preisgeben, können die gesammelten personenbezogenen Daten zu 'identifizierungs'-Bedrohungen führen.

source: Minimize user properties being transmitted
de: Minimieren der Übertragung von Benutzereigenschaften

source: Linkable User Requests Through Patterns
de: Verknüpfbare Benutzeranfragen durch Muster

source: Patterns in the (meta)data contained in user requests can be used to link them to each other
de: Muster in den (Meta-)Daten von Nutzeranfragen können genutzt werden, um diese miteinander zu verknüpfen.

source: Profiles can be constructed to distinguish users from one another and accumulate associated data. Dinstinguishing can happen based on things like the timing of messages, the writing style or other message patterns. Even if this data does not reveal one's identity directly, accumulated amounts of personal data can lead to 'identifying' threats.
de: Profile können erstellt werden, um Nutzer voneinander zu unterscheiden und zugehörige Daten zu sammeln. Die Unterscheidung kann beispielsweise anhand des Zeitpunkts von Nachrichten, des Schreibstils oder anderer Nachrichtenmuster erfolgen. Auch wenn diese Daten die Identität einer Person nicht direkt preisgeben, können die gesammelten persönlichen Daten zu 'identifizierungs'-Bedrohungen führen.

source: Transmit decoy requests
de: Senden von Täuschanfragen

source: Linkable Dataset
de: Verknüpfbarer Datensatz

source: Stored personal data can be linked to individuals
de: Gespeicherte personenbezogene Daten können mit Einzelpersonen verknüpft werden

source: Data can contain a lot of different properties that, when combined, pose quasi-identifiers enabling the linking of data to unique individuals or groups. An example would be querying average salary with a strict set of criteria to reveal the salary of an individual employee. Even if the properties do not reveal one's identity directly, accumulated amounts of personal data can lead to 'identifying' threats.
de: Daten können viele verschiedene Eigenschaften enthalten, die in ihrer Kombination Quasi-Identifikatoren darstellen und die Zuordnung von Daten zu einzelnen Personen oder Gruppen ermöglichen. Ein Beispiel wäre die Abfrage des Durchschnittsgehalts anhand strenger Kriterien, um das Gehalt eines einzelnen Mitarbeiters zu ermitteln. Auch wenn die Eigenschaften die Identität einer Person nicht direkt preisgeben, können akkumulierte Mengen personenbezogener Daten zu Bedrohungen für die Identifizierung führen.

source: Minimize collection and storage of user data
de: Minimieren der Erfassung und Speicherung von Benutzerdaten

source: Profiling Users
de: Profilierung von Benutzern

source: Users can be profiled by analyzing their data for patterns
de: Benutzer können durch die Analyse ihrer Daten auf Muster profiliert werden

source: It may be possible to derive data about individuals by analyzing their data. Adversaries could try to collect as much detailed data as possible to link data that wasn't intended to be linked. Example: Infering a persons medical condition by the frequency of data exchanges with a health monitoring machine.
de: Es ist möglich, durch die Analyse der persönlichen Daten von Einzelpersonen weitere Rückschlüsse zu ziehen. Angreifer könnten versuchen, möglichst viele detaillierte Daten zu sammeln, um Daten zu verknüpfen, die nicht verknüpft werden sollten. Beispiel: Rückschlüsse auf den Gesundheitszustand einer Person anhand der Häufigkeit des Datenaustauschs mit einem Gesundheitsüberwachungsgerät.

source: Leave out unnecessarily detailed data
de: Weglassen von unnötig detaillierten Daten

source: Identified User Requests
de: Identifizierte Benutzeranfragen

source: The incoming user requests contain data that directly reveal the user identity
de: Die eingehenden Nutzeranfragen enthalten Daten, die direkt Rückschlüsse auf die Identität des Nutzers zulassen.

source: Individuals may be identified directly through data sent to the system such as their full name. Identified data can severely amplify the impact of future data breaches and needs stronger security measures.
de: Personen können durch an das System übermittelte Daten, wie beispielsweise ihren vollständigen Namen, direkt identifiziert werden. Identifizierte Daten können die Auswirkungen künftiger Datenschutzverletzungen erheblich verstärken und erfordern stärkere Sicherheitsmaßnahmen.

source: Minimize transmission of user identities
de: Minimierung der Übertragung von Benutzeridentitäten

source: Identifiable User Requests
de: Identifizierbare Benutzeranfragen

source: The user can be identified because the data in their requests can be used to infer who they are
de: Der Nutzer kann identifiziert werden, da die Daten in seinen Anfragen verwendet werden können, um Rückschlüsse auf seine Identität zu ziehen.

source: Individuals may be identified through data sent to the system. This data does not have to be identity information but can still be unintentionally specific to a user. Examples: looking up nearby businesses, info about a rare illness or specific timing.
de: Personen können anhand der an das System übermittelten Daten identifiziert werden. Diese Daten müssen keine Identitätsinformationen sein, können aber unbeabsichtigt benutzerspezifisch sein. Beispiele: die Suche nach Geschäften in der Nähe, Informationen zu einer seltenen Krankheit oder bestimmtes Timing.

source: Minimize transmission of user data
de: Minimierung der Übertragung von Benutzerdaten

source: Identifiable Data Flows
de: Identifizierbare Datenflüsse

source: Data sent to the system is sufficiently revealing to identify the user
de: Die an das System gesendeten Daten sind ausreichend aufschlussreich, um den Benutzer zu identifizieren

source: Individuals may be identified through identifiable attributes in user-submitted data. For example in a feedback form.
de: Personen können anhand identifizierbarer Merkmale in den vom Nutzer übermittelten Daten identifiziert werden. Beispielsweise in einem Feedback-Formular.

source: Identifiable Data Requests
de: Identifizierbare Datenanfragen

source: Communication contains (quasi-)identifiers
de: Kommunikation enthält (Quasi-)Identifikatoren

source: Individuals may be identified through quasi-identifiers such as IP-address or email-address. The use of pseudonyms to refer to individuals may also lead to the identification of the person behind it. The possibility of identification rises with the amount of data connected with the quasi-identifier and the number of services using it.
de: Personen können über Quasi-Identifikatoren wie IP-Adresse oder E-Mail-Adresse identifiziert werden. Auch die Verwendung von Pseudonymen zur Personenbezeichnung kann zur Identifizierung der dahinterstehenden Person führen. Die Möglichkeit der Identifizierung steigt mit der Menge der mit dem Quasi-Identifikator verknüpften Daten und der Anzahl der Dienste, die ihn nutzen.

source: Don't reuse identifiers in another service
de: Kennungen sollten nicht in einem anderen Dienst erneut wiederverwendet werden

source: Identifiable Dataset
de: Identifizierbarer Datensatz

source: Stored data can be used to identify individuals
de: Gespeicherte Daten können zur Identifizierung von Personen verwendet werden

source: Individuals may be identified through connection of unique references to an individual or their data. The use of pseudonyms to refer to individuals may lead to the identification of the person behind it. The possibility of identification rises with the amount of data connected with the quasi-identifier and the number of services using it.
de: Einzelpersonen können durch die Verknüpfung eindeutiger Referenzen mit einer Person oder ihren Daten identifiziert werden. Die Verwendung von Pseudonymen zur Bezeichnung von Personen kann zur Identifizierung der dahinterstehenden Person führen. Die Möglichkeit der Identifizierung steigt mit der Menge der mit dem Quasi-Identifikator verknüpften Daten und der Anzahl der Dienste, die ihn nutzen.

source: Non-Repudiation of Service Usage
de: Nichtabstreitbarkeit von Servicenutzung

source: Users cannot deny having used a service because of authentication or logged access
de: Nutzer können die Nutzung eines Dienstes aufgrund von Authentifizierung oder protokolliertem Zugriff nicht leugnen.

source: If a service stores credentials with identity information, the individuals deniability gets affected. For example: log files linking an entry in an internal complaint system to an individual employee.
de: Wenn ein Dienst Anmeldeinformationen mit Identitätsinformationen speichert, beeinträchtigt dies die Abstreitbarkeit einzelner Personen. Beispiel: Protokolldateien, die einen Eintrag in einem internen Beschwerdesystem einem einzelnen Mitarbeiter zuordnen.

source: If deniability is required, do not store the data at all or remove any attributable data.
de: Wenn eine Abstreitbarkeit erforderlich ist, sollten Daten überhaupt nicht gespeichert werden oder alle zurechenbaren Daten entfernt werden.

source: Avoid credentials with identity information.
de: Anmeldeinformationen mit Identitätsinformationen sollten vermieden werden.

source: Non-Repudiation of Sending
de: Nichtabstreitbarkeit des Sendens

source: Users cannot deny having sent a message
de: Benutzer können nicht leugnen, eine Nachricht gesendet zu haben

source: Sent or uploaded data that is digitally signed affects the individuals deniability. For example: signed emails but also documents, requests, etc.
de: Digital signierte gesendete oder hochgeladene Daten beeinträchtigen die Abstreitbarkeit des Einzelnen. Beispiele hierfür sind signierte E-Mails, aber auch Dokumente, Anfragen usw.

source: Don't require data to be signed
de: Keine verpflichtende signierung von Daten

source: Non-Repudiation of Receipt
de: Nichtabstreitbarkeit des Empfangs

source: Users cannot deny having received a message
de: Benutzer können den Erhalt einer Nachricht nicht leugnen

source: If (passive) interactions with the system, such as receiving a message, have side-effects like logging, the deniability of receipt gets affected for the recipient.
de: Wenn (passive) Interaktionen mit dem System, wie beispielsweise der Empfang einer Nachricht, Nebeneffekte wie die Protokollierung haben, wird die Abstreitbarkeit des Empfangs für den Empfänger beeinträchtigt.

source: Don't require read receipts from the recipient
de: Keine verpflichtenden Lesebestätigungen von Empfängern

source: Don't log user's browser histories
de: Browserverlauf des Benutzers nicht protokollieren

source: Non-Repudiation of Storage
de: Nichtabstreitbarkeit der Speicherung

source: Users cannot deny claims about data stored in non-repudiable storage
de: Benutzer können Behauptungen bezüglich gespeicherten Daten nicht bestreiten

source: If data stored in a database is digitally signed, the repudiation of users gets affected. An example would be append-only storage systems like blockchains where it is impossible for the data subject to later remove their personal data.
de: Wenn in einer Datenbank gespeicherte Daten digital signiert sind, wirkt sich dies auf die Abstreitbarkeit der Nutzer aus. Ein Beispiel hierfür sind Append-Only-Speichersysteme wie Blockchains, bei denen es für die betroffenen Personen unmöglich ist, ihre personenbezogenen Daten später zu entfernen.

source: Non-Repudiation of Hidden Data or Metadata
de: Nichtabstreitbarkeit versteckter Daten oder Metadaten

source: Hidden or metadata in a document prevent users from denying claims associated with it
de: Versteckte Metadaten in einem Dokument verhindern, dass Nutzer Behauptungen abstreiten können.

source: Metadata, hidden data or specific patterns in stored or transmitted data may lead to undesirable deniability issues. For example, author or revision metadata in documents or data watermarked with hidden artifacts prevents users from denying claims about the data.
de: Metadaten, versteckte Daten oder bestimmte Muster in gespeicherten oder übertragenen Daten können zu unerwünschten Abstreitbarkeitsproblemen führen. Beispielsweise verhindern Autoren- oder Revisionsmetadaten in Dokumenten oder Daten, die mit versteckten Artefakten versehen sind, dass Nutzer Behauptungen bezüglich der Daten abstreiten können.

source: Minimize included metadata
de: Minimierung von enthaltenen Metadaten

source: Detectable Users
de: Erkennbare Benutzer

source: Inferring the existence of a user from the system's response
de: Von der Antwort des Systems auf die Existenz eines Benutzers schließen

source: Systems may unintentionally reveal the existence of a user by the way status messages respond to queries. This is especially relevant with informational messages, warnings or errors which respond differently when a user does not exist compared to not having access rights. An example would be a 'wrong password' error message revealing the existence of the account. Even though no contents have been leaked, the existence of certain items alone can be a stepping stone to security threats.
de: Systeme können die Existenz eines Benutzers unbeabsichtigt durch die Art und Weise verraten, wie Statusmeldungen auf Abfragen reagieren. Dies ist insbesondere bei Informationsmeldungen, Warnungen oder Fehlern relevant, die unterschiedlich reagieren, wenn ein Benutzer nicht existiert oder keine Zugriffsrechte hat. Ein Beispiel wäre eine Fehlermeldung 'Falsches Passwort', die die Existenz des Kontos verrät. Auch wenn keine Inhalte durchgesickert sind, kann allein die Existenz bestimmter Elemente ein Sprungbrett für Sicherheitsbedrohungen sein.

source: Prevent information leakage by not revealing the existence of items in system responses
de: Verhindern von Informationslecks, indem die Existenz von Elementen in Systemantworten nicht offengelegt wird.

source: Detectable Service Usage
de: Erkennbare Servicenutzung

source: Detecting communication between a service and its users
de: Erkennen der Kommunikation zwischen einem Dienst und seinen Benutzern

source: If the communication from a user to a service can be observed, information may be inferred from that. For example, communication with the Tor network can be detected even though the destination is concealed. Especially in sensitive contexts (medical, whistleblower) the detection of service usage alone may have a severe impact.
de: Wenn die Kommunikation eines Nutzers mit einem Dienst beobachtet werden kann, können daraus Informationen abgeleitet werden. Beispielsweise kann die Kommunikation mit dem Tor-Netzwerk erkannt werden, obwohl das Ziel verborgen ist. Insbesondere in sensiblen Kontexten (medizinisch, Whistleblower) kann die alleinige Erkennung der Dienstnutzung schwerwiegende Auswirkungen haben.

source: Minimize communications outside of private networks
de: Minimieren Sie die Kommunikation außerhalb privater Netzwerke.

source: Transmit decoy data
de: Senden von Täuschdaten

source: Every communication outside of trust boundaries with property: '{private_network} = True' will trigger this rule
de: Jede Kommunikation außerhalb der Vertrauensgrenzen mit der Eigenschaft: '{private_network}' = True löst diese Regel aus.

source: Detectable Events
de: Erkennbare Ereignisse

source: Detecting side effects or communications triggered by application events
de: Erkennen von Nebenwirkungen oder durch Anwendungsereignisse ausgelöste Kommunikationen

source: Various (unknown) side effects may lead to the detection of used applications or user actions. This can include log files on a shared system, traces of temporary files by deleted applications or the size of data. Sensitive information may be deduced from the observation of these side effects.
de: Verschiedene (unbekannte) Nebeneffekte können zur Erkennung verwendeter Anwendungen oder Benutzeraktionen führen. Dazu gehören Protokolldateien auf einem gemeinsam genutzten System, Spuren temporärer Dateien gelöschter Anwendungen oder die Größe von Daten. Aus der Beobachtung dieser Nebeneffekte können möglicherweise vertrauliche Informationen abgeleitet werden.

source: Ensure that all log files get deleted and that deleted data doesn't leave traces
de: Sicherstellen, dass alle Protokolldateien gelöscht werden und dass gelöschte Daten keine Spuren hinterlassen.

source: Dummy traffic may be able to conceal the actual traffic
de: Simulierter Verkehr kann möglicherweise den tatsächlichen Verkehr verschleiern

source: Detectable Records
de: Erkennbare Datensätze

source: Detecting the existence of records in a system
de: Erkennen der Existenz von Datensätzen in einem System

source: Systems may unintentionally reveal the existence of data by the way status messages respond to queries. This is especially relevant with informational messages, warnings or errors which respond differently when an item does not exist compared to not having access rights. An example would be an 'insufficient access rights' error message revealing the existence of a specific record. Even though no contents have been leaked, the existence of certain items alone can be a stepping stone to security threats.
de: Systeme können die Existenz von Daten unbeabsichtigt durch die Art und Weise verraten, wie Statusmeldungen auf Abfragen reagieren. Dies ist insbesondere bei Informationsmeldungen, Warnungen oder Fehlern relevant, die unterschiedlich reagieren, wenn ein Element nicht existiert oder wenn keine Zugriffsrechte vorliegen. Ein Beispiel wäre eine Fehlermeldung 'Unzureichende Zugriffsrechte', die die Existenz eines bestimmten Datensatzes verrät. Auch wenn keine Inhalte durchgesickert sind, kann allein die Existenz bestimmter Elemente ein Sprungbrett für Sicherheitsbedrohungen sein.

source: Excessively Sensitive Data Collected
de: Übermäßig sensible Daten gesammelt

source: The system acquires more sensitive or finegrained data than strictly necessary for its functionality
de: Das System erfasst sensiblere oder detailliertere Daten als unbedingt erforderlich

source: It should be considered if certain data should really be collected in terms of the data being too sensitive, more fine-grained than strictly necessary or it being unnecessary metadata. For example, a camera application does not necessarily need to record the pictures location. Processing excessively sensitive data poses a bigger risk in case of potential data breaches.
de: Es sollte geprüft werden, ob bestimmte Daten tatsächlich erhoben werden sollten, da sie möglicherweise zu sensibel sind, zu detailliert als unbedingt erforderlich sind oder unnötige Metadaten enthalten. Beispielsweise muss eine Kameraanwendung nicht unbedingt den Aufnahmeort aufzeichnen. Die Verarbeitung übermäßig sensibler Daten birgt ein höheres Risiko im Falle potenzieller Datenlecks.

source: Assess whether all the data is genuinely necessary for providing the system's functionality
de: Evaluierung, ob alle Daten für die Bereitstellung der Systemfunktionalität wirklich erforderlich sind.

source: Excessive Amount of Data Collected
de: Übermäßige Menge an gesammelten Daten

source: The system acquires more data than strictly needed for its functionality
de: Das System erfasst mehr Daten als unbedingt für seine Funktionalität erforderlich sind

source: It should be considered if the amount of data collected is too large, the processing happens too frequently or if there are more data subjects involved than necessary. For example, posts on social networks may include personal data about other individuals. Processing excessive amounts of data poses a bigger risk as it may give way to privacy threats such as pattern analysis.
de: Es sollte berücksichtigt werden, ob die erhobene Datenmenge zu groß ist, die Verarbeitung zu häufig erfolgt oder mehr betroffene Personen als nötig beteiligt sind. Beispielsweise können Beiträge in sozialen Netzwerken personenbezogene Daten anderer Personen enthalten. Die Verarbeitung übermäßiger Datenmengen birgt ein größeres Risiko, da sie zu Datenschutzverletzungen führen kann, beispielsweise bei der Musteranalyse.

source: Evaluate whether regular data collection is necessary for the system's functionality.
de: Evaluierung, ob eine regelmäßige Datenerfassung für die Funktionalität des Systems erforderlich ist.

source: Unnecessary Data Analysis
de: Unnötige Datenanalyse

source: Data is further processed, analyzed, or enriched in a way that is not strictly necessary for the functionality
de: Daten werden in einer Weise weiterverarbeitet, analysiert oder angereichert, die für die Funktionalität nicht unbedingt erforderlich ist.

source: A system should not enrich/analyze the data more than it is necessary for the system's functionality. For example, a camera application does not need to perform face-based recognition. Processing of data can be used to learn additional sensitive information.
de: Ein System sollte die Daten nicht stärker anreichern/analysieren, als es für seine Funktionalität erforderlich ist. Beispielsweise muss eine Kameraanwendung keine gesichtsbasierte Erkennung durchführen. Die Datenverarbeitung kann genutzt werden, um zusätzliche sensible Informationen zu gewinnen.

source: Evaluate which types of personal data processing are necessary for providing the system's functionality.
de: Evaluierung, welche Arten der Verarbeitung personenbezogener Daten für die Bereitstellung der Systemfunktionalität erforderlich sind.

source: Unnecessary Data Retention
de: Unnötige Datenspeicherung

source: Data is stored for longer than needed
de: Daten werden länger als nötig gespeichert
