Repository: pypi-data/pypi-mirror-385
Catalog: packages/pretix-xpay/pretix_xpay-1.0.20251019.tar.gz/pretix_xpay-1.0.20251019/pretix_xpay/locale/*/LC_MESSAGES/django.po
Languages: it

source: Pay through XPay
it: Paga con XPay

source: XPay's Alias key
it: Chiave Alias XPay

source: Check your backoffice area to recover the Alias value.
it: Recupera da backoffice il tuo Alias.

source: Mac's hash algorithm
it: Algoritmo di hashing Mac

source: By default it is set to SHA-1, contact XPay's support in order to use SHA-256.
it: Impostato a SHA-1 come predefinito, contatta il supporto di XPay per cambiare l'algoritmo a SHA-256.

source: Mac Secret
it: Chiave MAC

source: Check your backoffice area to recover the mac secret value. It is used to secure the hash
it: Recupera il valore dalla tua area di backoffice. Viene utilizzato per convalidare i codici hash

source: Pending order timeout (mins)
it: Timeout scadenza ordini in attesa (minuti)

source: Pending and newly created payment orders are refreshed with regular intervals, to check if the user have actually paid, but left the process of returning back to pretix's pages. This timeout specifies in how much time the payment should be considered over and should be marked as expired.
it: Gli ordini appena creati e in attesa vengono analizzati con intervalli regolari, qualora un utente pagasse l'ordine ma non venisse reindirizzato alla pagina di esito di Pretix. Questo timeout specifica in quanto tempo questi pagamenti dovrebbero essere considerati scaduti.

source: Failed payments email address
it: Indirizzi email per notifica pagamenti falliti

source: Enter an email address recipient for manual verification requests. It might happen because of a failed refund request, or an already charged payment.
it: Inserisci un indirizzo email destinatario di tutte le richieste d'intervento manuale. Potrebbe accadere per via di un'errore durante le richieste di rimborso automatiche, o per un pagamento contabilizzato da rimborsare.

source: Enable test endpoints
it: Abilita endpoint di test

source: This enables the endpoints /poll_pending_payments and /test_manual_refund_email for events in testmode
it: Abilita gli endpoint /poll_pending_payments e /test_manual_refund_email per gli eventi in modalità di test

source: The XPay plugin is operating in test mode. No money will actually be transferred, but BE SURE to check you're redirected to {TEST_URL}.
it: Il plugin di XPay è in modalità di test. Nessun denaro sarà trasferito, ma sii sicuro di essere reindirizzato a {TEST_URL}.

source: XPay reported an event (Status {status}).
it: XPay ha rilevato un evento (Stato {status}).

source: Payment in refund or canceled state
it: Pagamento rimborsato o cancellato

source: After you submitted your order, we will redirect you to our payment provider to complete your payment. You will then be redirected back here to get your tickets.
it: Una volta inviato il proprio ordine, ti reindirizzeremo verso il nostro fornitore per completare il pagamento. Ritornerai a questa pagina una volta finita l'operazione.

source: You need to turn on JavaScript for this payment method to work.
it: Devi abilitare JavaScript per autorizzare il pagamento.

source: We're waiting for an answer from the payment provider regarding your payment. Please contact us if this takes more than a few days.
it: Stiamo in attesa di una risposta dal nostro fornitore. Contatta il supporto qualora il processo impiegasse più giorni.

source: The payment transaction could not be completed for the following reason:
it: La transazione non è andata a buon fine per i seguenti problemi:

source: Unknown reason
it: Motivo sconosciuto

source: Redirecting...
it: Reindirizzamento...

source: You will be redirected shortly.
it: Verrete reindirizzati al più presto.

source: If this takes longer than a few seconds, press this button:
it: Se dopo due secondi non siete stati reindirizzati, premere questo pulsante:

source: Please turn on JavaScript, before you continue.
it: Abilitare JavaScript per continuare.

source: Continue
it: Continua

source: Severe error in XPay's payment process
it: Errore grave nella fase di pagamento XPay

source: A severe error occurred while processing the OrderPayment {op_full_id} with transactionId {transaction_id}. The user has probably paid more than expected (due to a double payment or to a Quota Exceeded problem) and a manual refund is needed. Please verify the payment and order status and, in case, proceed with a manual refund. This email is autogenerated by the XPay plugin by the "{origin}" origin. For more information, contact us on https://github.com/APSfurizon/pretix-xpay/
it: Un errore grave è stato rilevato durante l'elaborazione dell'ordine {op_full_id} con transactionId {transaction_id}. L'utente potrebbe aver pagato più di quanto previsto (a causa di un doppio pagamento, o per un problema di quota esausta), pertanto è richiesto un rimborso. Verificare il pagamento e lo stato d'ordine e, in caso, procedere ad un rimborso manuale. Questa email è stata generata dal plugin di XPay, originata da "{origin}". Per maggiori informazioni, contattaci su https://github.com/APSfurizon/pretix-xpay/

source: Could not parse operation.
it: Non è stato possibile elaborare un'operazione.

source: Could not parse order %s
it: Impossibile elaborare l'ordine %s

source: You payment is now pending. You will be notified either if the payment is confirmed or not.
it: Il tuo pagamento è in attesa. Verrai notificato qualora verrà confermato o meno.

source: The payment has failed. You can click below to try again.
it: C'è stato un errore nel pagamento. Clicca il pulsante per riprovare.

source: Payment result is in a failed status
it: Lo stato di pagamento risulta fallito

source: Sorry, we could not validate the payment result. Please try again or contact the event organizer to check if your payment was successful.
it: C'è stato un problema nell'elaborare il pagamento. Riprova o contatta l'organizzatore per controllare che il pagamento sia riuscito.

source: The was an availability error while confirming your order! A refund has been issued.
it: C'è stato un problema di disponibilità dei prodotti durante la conferma! ́È stato richiesto un rimborso.

source: The payment has failed. You can click below to try again. Details: %s
it: C'è stato un errore nel pagamento. Clicca il pulsante per riprovare. Dettaglio errore: %s

source: An error occurred with the XPay's servers while capturing the order. Contact the event organizer and check if your order is successfull and the correct amount of money has been trasferred from your account. Be sure to remember the transaction code #%s. Exception: %s
it: C'è stato un errore con i server di XPay durante la contabilizzazione dell'ordine. Contatta l'organizzatore per verificare che la transazione abbia avuto successo e che sia stata trasferita la giusta somma. Il codice di transazione è #%s. Dettagli errore: %s

source: Preauth confirm request failed with error code %d: %s. Contact the event organizer and check if your order is successfull and the correct amount of money has been trasferred from your account. Be sure to remember the transaction code #%s
it: C'è stato un errore nella richiesta di pre-autorizzazione, codice %d: %s. Contatta l'organizzatore per verificare che la transazione abbia avuto successo e che sia stata trasferita la giusta somma. Il codice di transazione è #%s

source: Unable to validate the preauth confirm. Contact the event organizer and check if your order is successfull and the correct amount of money has been trasferred from your account. Be sure to remember the transaction code #%s
it: C'è stato un errore nella verifica esito di pre-autorizzazione. Contatta l'organizzatore per verificare che la transazione abbia avuto successo e che sia stata trasferita la giusta somma. Il codice di transazione è #%s

source: Unknown server response (%s) in the preauth confirm process. Contact the event organizer and check if your order is successfull and the correct amount of money has been trasferred from your account. Be sure to remember the transaction code #%s
it: C'è stato un errore nella verifica esito di pre-autorizzazione (%s). Contatta l'organizzatore per verificare che la transazione abbia avuto successo e che sia stata trasferita la giusta somma. Il codice di transazione è #%s

source: Preauth refund request failed with error code %d: %s. Contact the event organizer to execute the refund manually. Be sure to remember the transaction code #%s
it: Richiesta rimborso pre-autorizzazione fallito con errore %d: %s. Contatta l'organizzatore per richiedere un rimborso manualmente. Il codice di transazione è #%s

source: Unable to validate the preauth refund. Contact the event organizer to execute the refund manually. Be sure to remember the transaction code #%s
it: C'è stato un errore durante la verifica esito di rimborso. Contatta l'organizzatore per richiedere un rimborso manualmente. Il codice di transazione è #%s

source: Unknown server response (%s) in the preauth confirm process. Contact the event organizer to execute the refund manually. Be sure to remember the transaction code #%s
it: C'è stato un errore durante la verifica esito di pre-autorizzazione (%s). Contatta l'organizzatore per richiedere un rimborso manualmente. Il codice di transazione è #%s

source: Unable to check the order status for %s. Error code: %d. Error message: "%s"
it: Non è stato possibile verificare lo stato dell'ordine %s. Codice errore %d. Messaggio errore: "%s"

source: Invalid parameter "esito" (%s) for %s.
it: Valore inatteso di "esito" (%s) per l'ordine %s.

source: Unable to validate the order status for %s.
it: Impossibile verificare lo stato dell'ordine %s.

source: Could not reach payment provider.
it: Impossibile raggiungere i server del servizio di pagamento.
