Repository: pypi-data/pypi-mirror-385
Catalog: packages/localcosmos-server/localcosmos_server-0.24.3.tar.gz/localcosmos_server-0.24.3/localcosmos_server/locale/*/LC_MESSAGES/django.po
Languages: de

source: current image
de: aktuelles Bild

source: include descendants
de: Nachkommen mit einschließen

source: search and select taxon
de: Taxon suchen und auswählen

source: no taxa found
de: Kein Taxon gefunden

source: Change image
de: Bild ändern

source: Invalid SVG file: could not detect SVG in XML tree of the file.
de: Ungültige SVG Datei: svg nicht im xml tree der Datei gefunden.

source: Wrong image ratio. Upload a file with the dimensions w:h = %(ratio)s
de: Falsche Bildabmessungen. Lade eine Datei mit den Abmessungen Breite:Höhe = %(ratio)s hoch.

source: Invalid SVG file: did neither find viewBox setting or width and height setting in the SVG file.
de: Ungültige svg Datei: Entweder wurde die viewBox Einstellung nicht gefunden oder die Einstellung für width und height fehlen.

source: Wrong image dimensions. You image has to be EXACTLY width x height = %(dimensions)s
de: Falsche Bildmaße. Das Bild muss EXAKT %(dimensions)s (Breite x Höhe) sein.

source: No user found for that username or email address.
de: Kein Benutzer für diesen Benutzernamen oder diese e-mail gefunden.

source: Unable to log in with provided credentials.
de: Anmelden mit den eingegebenen Daten nicht möglich.

source: Must include "username", "password", "client_id" and "platform".
de: "username", "password", "client_id" und "platform" müssen enthalten sein.

source: Password (again)
de: Passwort (nochmal)

source: First name (optional)
de: Vorname (optional)

source: Surname (optional)
de: Nachname (optional)

source: Email address
de: E-Mail Addresse

source: Email address (again)
de: E-Mail Addresse (nochmal)

source: Select timestamp
de: Zeitpunkt auswählen

source: Year
de: Jahr

source: Month
de: Monat

source: Day
de: Tag

source: Hour
de: Stunde

source: Set date
de: Datum setzen

source: Enter valid text.
de: Gültigen Text eingeben.

source: Name for links in navigation menus
de: Name für Links in Navigationen

source: Max %(characters)s characters. If this content shows up in a navigation menu, this name will be shown as the link.
de: Höchstens %(characters)s Zeichen. Falls dieser Inhalt in einer Navigation angezeigt wird, wird dieser Name als Link angezeigt.

source: Show link to this online content in
de: Zeige Link zu diesem Online Content in

source: The title will be the name of the link in the navigations. Long titles will be cut off.
de: Der Titel wird der Name des Links in Navigationen sein. Lange Titel werden abgeschnitten.

source: The translator for the language %(language)s is still working
de: Der Übersetzer für die Sprache %(language)s arbeitet noch

source: Do you really want to delete this content?
de: Willst du diesen Inhalt wirklich löschen?

source: You marked the content in this language as ready for translation.
de: Du hast diesen Inhalt als für die Übersetzung bereit markiert.

source: Could not set this page as ready for translation:
de: Diese Seite konnte nicht als für die Übersetzung bereit markiert werden:

source: save page as draft
de: Seite als Entwurf speichern

source: Ready for translation
de: bereit für die Übersetzung

source: Publish changes
de: Änderungen veröffentlichen

source: You do not have any online feature content for this app yet.
de: Du hast noch keinen Feature Content für diese App.

source: Add new feature
de: Neues Feature hinzufügen

source: This translation is marked as complete.
de: Diese Übersetzung wurde als vollständig markiert.

source: This translation is not yet complete.
de: Diese Übersetzung ist noch nicht vollständig.

source: save
de: speichern

source: translation is complete
de: Übersetzung ist vollständig

source: This content is still being edited in the primary language. It will be translatable as soon as the editor is finished creating the content in the primary language.
de: Dieser Inhalt wird noch in der Primärsprache bearbeitet. Sobald der Ersteller mit der Primärsprache fertig ist, kann der Text übersetzt werden.

source: Read more
de: Mehr lesen
