Repository: pypi-data/pypi-mirror-385
Catalog: packages/localcosmos-server/localcosmos_server-0.24.3.tar.gz/localcosmos_server-0.24.3/localcosmos_server/locale/*/LC_MESSAGES/django.po
Languages: de

source: This email address is already registered.
de: Diese E-Mail Addresse ist bereits registriert

source: The email addresses did not match.
de: Die beiden E-Mail Addressen stimmten nicht überein.

source: The passwords did not match.
de: Die Passwörter stimmten nicht überein

source: No matching user found.
de: Kein passender Benutzer gefunden.

source: user
de: Nutzer

source: Search user
de: Nutzer suchen

source: Last login
de: Letzte Anmeldung

source: Modify
de: bearbeiten

source: Assign new role
de: Neue Rolle zuweisen

source: Delete
de: Löschen

source: Users
de: Benutzer

source: Template content
de: Template Inhalte

source: Observations
de: Beobachtungen

source: Manage observations
de: Beobachtungen verwalten

source: Manage validation routine
de: Validierungsroutine verwalten

source: Sign out
de: abmelden

source: Observations waiting for review
de: Beobachtungen, die auf eine Prüfung warten

source: No observations are waiting for review.
de: Keine Beobachtungen warten auf Prüfung.

source: Observations that need identification
de: Beobachtungen, die eine Identifizierung benötigen

source: No observations need identification.
de: Keine Beobachtungen benötigen eine Identifizierung.

source: Manage role of %(username)s
de: Rolle von %(username)s verwalten

source: Successfully assigned new role.
de: Neue Rolle erfolgreich zugewiesen.

source: Forgotten your password? Enter your email address below, and we'll email instructions for setting a new one.
de: Passwort vergessen? Gib unten deine E-Mail Adresse ein, und wir schicken dir Anweisungen, wie du ein neues Passwort setzen kannst.

source: Reset my password
de: Mein Passwort zurücksetzen

source: No users found.
de: Keine Benutzer gefunden.

source: No admins yet.
de: Noch keine Admins.

source: Experts
de: Experten

source: No experts yet.
de: Noch keine Experten.

source: No users yet.
de: Noch keine Nutzer.

source: Invalid observation form given.
de: Ungültiges Beobachtungsformular angegeben

source: Object with uuid={value} does not exist.
de: Objekt mit uuid={value} existiert nicht.

source: Invalid value.
de: Ungültiger Wert

source: Observation Form does not exist
de: Das Beobachtungsformular existiert nicht

source: Invalid field uuid: %(field_uuid)s
de: Ungültige field uuid: %(field_uuid)s

source: The field %(field_name)s is required.
de: Das Feld %(field_name)s ist erforderlich.

source: Invalid datatype for %(field_name)s.
de: Ungültiger Datentyp für %(field_name)s.

source: Minimum value for %(field_name)s is %(min)s.
de: Minimaler Wert für %(field_name)s ist %(min)s.

source: Maximum value for %(field_name)s is %(max)s.
de: Maximaler Wert für %(field_name)s ist %(max)s.

source: Invalid choice for %(field_name)s: %(value)s
de: Ungültige Auswahl für %(field_name)s: %(value)s

source: This step already exists in your Validation Routine
de: Dieser Schritt existiert bereits in deiner Validierungsroutine

source: Taxon (scientific name)
de: Taxon (wissenschaftlicher Name)

source: Unidentified
de: Nicht identifiziert

source: enabled
de: aktiv

source: disabled
de: inaktiv

source: Darwin Core database view
de: Darvin Core Datenbank View

source: Disable Darwin Core
de: Darwin Core deaktivieren

source: Enable Darwin Core
de: Darwin Core aktivieren

source: Observation without taxon
de: Beobachtung ohne Taxon

source: observed at
de: hier beobachtet

source: submitted at
de: gesendet am

source: valid
de: valide

source: invalid
de: nicht valide

source: observed by
de: beobachtet von

source: Anonymous user
de: anonymer Nutzer

source: Show
de: Anzeigen

source: No observations yet.
de: Noch keine Beobachtungen.

source: Review now
de: Jetzt prüfen

source: Download csv
de: csv herunterladen

source: Download data
de: Daten herunterladen

source: creating csv
de: erstelle csv

source: If you want to publish your observations on GBIF, a database table in the Darwin Core format has to be enabled.
de: Falls du Beobachtungen an GBIF senden möchtest, muss dafür ein Datenbank View im Darwin Core Format aktiviert werden.

source: Observation validation routine
de: Validierungsroutine für Beobachtungen

source: Defining an observation validation routine helps to improve the quality of your collected data. You can set specific steps for specific taxa. For example, you might want to have an expert to look at reports of rare species and have him check the datasets photo.
de: Das Erstellen einer Validierungsroutine für Beobachtungen kann dabei helfen, die Qualität der gesammelten Daten zu verbessern. Du kannst Validierungsschritte optional auf bestimmte Taxa beschränken. Zum Beispiel möchtest Du vielleicht, dass ein Experte sich Beobachtungen seltener Arten anschaut und das Foto des Datensatzes prüft.

source: Step 0:
de: Schritt 0:

source: User saves dataset
de: Nutzer speichert Datensatz

source: After successfully filling out an observation form without errors.
de: Nach erfolgreichem, fehlerfreien Ausfüllen eines Beobachtungsformulars.

source: Step %(position)s:
de: Schritt %(position)s:

source: Applies to:
de: Betrifft:

source: manage taxonomic restrictions
de: Taxonomische Restriktionen verwalten

source: Move up
de: nach oben

source: Move down
de: nach unten

source: Final step:
de: Letzter Schritt:

source: Dataset is marked as valid
de: Datensatz wird als valide markiert

source: Add step
de: Schritt hinzufügen

source: Available additional validation steps
de: Verfügbare zusätzliche Validierungsschritte

source: Observation
de: Beobachtung

source: by
de: von

source: anonymous user
de: anonymer Nutzer

source: contact user
de: Nutzer kontaktieren

source: Download all observations as .csv
de: Alle Beobachtungen als .csv herunterladen

source: Download
de: herunterladen

source: Filters
de: Filter

source: Nothing found.
de: Nichts gefunden.

source: Manage validation step
de: Validierungsschritt verwalten

source: Successfully saved your validation step.
de: Validierungsschritt erfolgreich gespeichert.

source: Add image
de: Bild hinzufügen

source: Changes have been saved successfully.
de: Änderungen wurden erfolgreich gespeichert.

source: Update dataset
de: Datensatz aktualisieren

source: Delete dataset
de: Datensatz löschen

source: Observation has been deleted.
de: Beobachtung würde gelöscht.

source: Do you really want to delete this image?
de: Willst du dieses Bild wirklich löschen?

source: Image
de: Bild

source: No images found.
de: keine Bilder gefunden

source: add image
de: Bild hinzufügen

source: Expert review
de: Expertenreview

source: Thank you for your review
de: Vielen Dank für dein Review

source: You marked this observation as valid.
de: Du hast diese Beobachtung als valide markiert.

source: You marked this observation as invalid.
de: Du hast diese Beobachtung als nicht valide markiert.

source: Back to overview
de: zurück zur Übersicht

source: Your review
de: Dein Review

source: Before submitting your review, please try to correct the observation if it contains errors. If you have been able to correct the data, mark the observation as valid.
de: Bevor du dein Review abschickst solltest du versuchen, die Beobachtung zu korrigieren, falls diese Fehler enthält. Markiere die Beobachtung als valide, falls es dir möglich war, die Daten zu korrigieren.

source: Submit review
de: Review abschicken

source: In your app this button opens the camera.
de: In deiner App öffnet dieser Button die Kamera.

source: In your app this button opens the photo album.
de: In deiner App öffnet dieser Button das Fotoalbum.

source: Point
de: Punkt

source: Area
de: Gebiet

source: This dataset is currently waiting for review.
de: Dieser Datensatz wartet momentan auf eine Prüfung.

source: This dataset failed the review.
de: Dieser Datensatz hat die Prüfung nicht bestanden.

source: The following fields are required but missing:
de: Folgende Pflichtfelder waren leer:

source: Observation is valid
de: Beobachtung ist valide

source: Observation is invalid
de: Beobachtung ist nicht valide

source: Reference fields validator
de: Referenzfeld-Prüfer

source: Automatically checks if taxon, date/time, and location are given.
de: Prüft automatisch, ob Taxon, Zeitpunkt und Ort vorhanden sind.

source: This observation is currently waiting for review.
de: Diese Beobachtung wartet momentan auf eine Prüfung.

source: An expert will review the dataset. This validation can include the analysis of images.
de: Ein Experte prüft den Datensatz. Diese Validierung kann die Analyse von Bildern beinhalten.

source: Do you really want to remove {0}?
de: Willst du wirklich {0} entfernen?

source: Do you really want to delete this obsersavtion?
de: Willst du wirklich diese Beobachtung löschen?

source: Point or Area
de: Punkt oder Gebiet

source: Username or email address
de: Nutzername oder E-Mail

source: Invalid username or email address
de: Nutername oder E-Mail ungültig

source: You selected an invalid area of the image.
de: Du hast einen ungültigen Bereich des Bildes ausgewählt.

source: Invalid features drawn on canvas.
de: Ungültiges Element gezeichnet

source: The image upload was not successful. Please try again.
de: Das Hochladen des Bildes war nicht erfolgreich. Bitte nochmal versuchen.

source: Primary image
de: Primäres Bild

source: Text that will be shown together with this image.
de: Text, der zusammen mit diesem Bild gezeigt wird

source: This field is required.
de: Dieses Feld ist erforderlich.

source: Registration confirmation
de: Registrierungsbestätigung

source: expert
de: Experte

source: exists
de: existiert

source: required
de: benötigt

source: App .zip file
de: App .zip Datei

source: URL of this app
de: URL dieser App

source: Absolute URL where your app will be served according to your web server configuration.
de: Absolute URL unter der die App gemäß der Konfiguration des Webservers bereitgestellt wird.

source: e.g. mysite.com or mysite.com/app
de: z.B. mysite.com oder mysite.com/app

source: working
de: funktioniert

source: Overview
de: Übersicht

source: Install app
de: App installieren

source: Edit %(name)s
de: %(name)s ändern

source: Successfully updated your app.
de: App erfolgreich aktualisiert.

source: Save
de: Speichern

source: Use this url in the app kit on localcosmos.org to connect your app to this server.
de: Benutze diese url im App Kit auf localcosmos.org um deine App mit diesem Server zu verbinden.

source: Installed apps
de: Installierte Apps

source: Edit
de: bearbeiten

source: Update
de: aktualisieren

source: Uninstall
de: deinstallieren

source: not available
de: nicht verfügbar

source: draft
de: Entwurf

source: More information will be avaibale when this app has been published.
de: Sobald diese App veröffentlicht wurde, sind mehr Informationen verfügbar.

source: You have not installed any apps yet.
de: Du hast noch keine Apps installiert.

source: Install new app
de: Neue App installieren

source: Update %(name)s
de: %(name)s aktualisieren

source: Your app has been installed successfully. You can check its status in the overview.
de: Deine App wurde erfolgreich installiert. Du kannst deren Status in der Übersicht sehen.

source: Important information
de: Wichtige Information

source: Your web app will be installed in %(localcosmos_apps_root)sAPP_UID/
de: Deine WebApp wird in %(localcosmos_apps_root)sAPP_UID/ installiert

source: You can look up your APP_UID on localcosmos.org
de: Du kannst deine APP_UID auf localcosmos.org nachschlagen

source: Your webserver (nginx or apache) will serve your web app, not django
de: Deine WebApp wird von deinem Webserver (nginx oder apache) bereitgestellt, nicht von django

source: Make sure to set an alias to %(localcosmos_apps_root)sAPP_UID/www/ in your web server
de: Stelle sicher, dass ein Alias für %(localcosmos_apps_root)sAPP_UID/www/ in deinem Webserver konfiguriert ist

source: Your Android and iOS Apps will be able to connect to your server after you installed the web app
de: Deine Android und iOS Apps können sich erst mit deinem Server verbinden, nachdem du die WebApp auf diesem installiert hast.

source: The following errors occured during app import:
de: Während des imports gab es folgende Fehler:

source: Install
de: installieren

source: Error importing the app. Please upload a valid app .zip file: {0}
de: Fehler beim import der App. Bitte lade eine valide App .zip Datei hoch: {0}

source: The zip file you uploaded does not contain the app {0}
de: Die zip Datei, die du hochgeladen hast enthielt nicht die App {0}

source: Do you really want to uninstall %s?
de: Willst du %s wirklich deinstallieren ?

source: The two password fields didn't match.
de: Die beiden Passwörter stimmten nicht überein.

source: The two email address fields didn't match.
de: Die beiden E-Mail Addressen stimmten nicht überein.

source: Email (again)
de: E-Mail (nochmal)

source: Include descendants
de: Nachkommen mit einschließen

source: Do you really want to remove %s?
de: Willst du %s wirklich entfernen ?

source: Title
de: Titel

source: A navigation of type %(navigation_type)s already exists
de: Eine Navigation vom Typ %(navigation_type)s existiert bereits

source: Page
de: Seite

source: Name of the navigation
de: Name der Navigation

source: Component
de: Komponente

source: Translation for the language %(language)s is missing
de: Übersetzung in die Sprache %(language)s fehlt

source: The component "%(component_name)s" is required but still missing for the language %(language)s.
de: Die Komponenente "%(component_name)s" ist Pflicht, fehlt aber in der Sprache %(language)s

source: Content is still missing for the language %(language)s.
de: Der Inhalt fehlt in der Sprache %(language)s

source: The translation for the language %(language)s is incomplete.
de: Übersetzung in die Sprache %(language)s ist unvollständig

source: No image supplied.
de: Keine Bilder vorhanden.

source: Delete component
de: Komponente löschen

source: Delete component %(component_template_name)s
de: Komponente %(component_template_name)s löschen

source: Manage %(name)s
de: %(name)s verwalten

source: Create %(name)s
de: %(name)s erstellen

source: Cancel
de: Abbrechen

source: Manage %(navigation)s
de: %(navigation)s verwalten

source: Create navigation
de: Navigation erstellen

source: Manage %(navigation_entry)s
de: %(navigation_entry)s verwalten

source: Create navigation entry
de: Navigationseintrag erstellen

source: Manage
de: verwalten

source: Edit navigation type
de: Art der Navigatoin ändern

source: Publish
de: veröffentlichen

source: Translate into %(language)s
de: nach %(language)s übersetzen

source: show
de: zeigen

source: There is no component that needs to be translated.
de: Es ist keine Komponente vorhanden, die übersetzt werden muss.

source: Publication failed:
de: Veröffentlichung fehlgeschlagen:

source: Publication successful.
de: Veröffentlichung erfolgreich

source: published version: %(version)s
de: veröffentlichte Version: %(version)s

source: not published
de: nicht veröffentlicht

source: current version: %(version)s
de: aktuelle Version: %(version)s

source: old version
de: alte Version

source: translation complete
de: Übersetzung vollständig

source: translation incomplete
de: Übersetzung unvollständig

source: missing
de: fehlt

source: Unpublish %(template_content)s
de: Veröffentlichung von %(template_content)s aufheben

source: Successfully unpublished %(template_content)s
de: Veröffentlichung von %(template_content)s erfolgreich aufgehoben

source: Do you really want to unpublish %(template_content)s?
de: Willst du die Veröffentlichung von %(template_content)s wirklich aufheben?

source: Close
de: Schließen

source: Unpublish
de: Veröffentlichung aufheben

source: Add new %(template_type)s
de: %(template_type)s hinzufügen

source: Add
de: hinzufügen

source: Your frontend does not supply any templates.
de: Dein Frontend enthält keine Templates

source: You can create and upload your own custom templates.
de: Du kannst eigene Templates erstellen und hochladen

source: Upload custom template
de: Custom Template hochladen

source: published
de: veröffentlicht

source: unpublished changes
de: unveröffentlichte Änderungen

source: ready for translation
de: bereit für die Übersetzung

source: not ready for translation
de: nicht für die Übersetzung bereit

source: Successfully saved your content.
de: Der Inhalt wurde erfolgreich gespeichert.

source: Components
de: Komponenten

source: save content
de: Inhalte speichern

source: Preview
de: Vorschau

source: Show in separate window
de: in separatem Fenster anzeigen

source: no entries yet
de: Noch keine Einträge

source: add entry
de: Eintrag hinzufügen

source: TemplateContent
de: Template Inhalte

source: Navigations
de: Navigationen

source: You do not have any navigations for this app yet.
de: Du hast noch keine Navigationen für diese App.

source: Add new navigation
de: Neue Navigation hinzufügen

source: Your frontend does not support navigations.
de: Dein Frontend enthält keine Navigationen

source: Pages
de: Seiten

source: You do not have any online pages for this app yet.
de: Du hast noch keine Seiten für diese App.

source: Add new page
de: Neue Seite hinzufügen

source: Frontend requirements
de: Frontend-Anforderungen

source: create
de: erstellen

source: Successfully saved your translation.
de: Übersetzung erfolgreich gespeichert.

source: save translation
de: Übersetzung speichern

source: Before translating the components, you have to translate the title.
de: Bevor Komponenten übersetzt werden können, muss zuerst der Titel übsersetzt werden.

source: There is no content that needs to be translated.
de: Es gibt keine zu übersetzenden Inhalte.

source: This image does not require a translation. The image above (if any) will be used for all languages.
de: Dieses Bild benötigt keine Übsersetzung. Das angezeigt Bild wird, falls vorhanden, für alle Sprachen benutzt.

source: Change %(name)s
de: %(name)s ändern

source: Add %(name)s
de: %(name)s hinzufügen

source: You are not allowed to perform the operation you requested.
de: Du bist nicht berechtigt, die angeforderte Operation durchzuführen.

source: The requested page could not be found.
de: Die angeforderte Seite wurde nicht gefunden.

source: Unfortunately, there has been an internal server error.
de: Leider gab es einen internen Server Fehler.

source: more
de: mehr

source: Message from %(username)s
de: Nachrichten von %(username)s

source: Reply to %(username)s: %(email)s
de: %(username)s antworten: %(email)s

source: Questions?
de: Fragen?

source: Legal notice
de: Impressum

source: Privacy statement
de: Datenschutzerklärung

source: Registration confirmation.
de: Registrierungsbestätigung.

source: Hello %(name)s!
de: Hallo %(name)s!

source: Thank you for registering on %(name)s.
de: Vielen Dank für die Registrierung auf %(name)s.

source: Your username is: %(username)s
de: Dein Nutzername ist: %(username)s

source: Go back to website
de: Zurück zur Webseite

source: Delete image
de: Bild löschen

source: Manage image
de: Bild verwalten

source: We've emailed you instructions for setting your password, if an account exists with the email you entered. You should receive them shortly.
de: Wir haben dir Anweisungen geschickt, wie du ein neues Passwort setzen kannst, falls ein Account für diese E-Mail Addresse existiert. Die E-Mail sollte in Kürze ankommen.

source: If you don't receive an email, please make sure you've entered the address you registered with, and check your spam folder.
de: Falls du keine E-Mail erhältst, musst du sicherstellen, dass du auch diejenige E-Mail Addresse eingibst, mit der du dich registriert hast. Schaue auch im Spam-Ordner nach.

source: There have been errors in the data you submitted.
de: Die von dir übermittelten Daten enthielten Fehler.

source: Welcome %(username)s. Your account has been created successfully and you have been logged in.
de: Willkommen %(username)s. Dein Account wurde erfolgreich angelegt und du wurdest angemeldet.

source: Your password has been set. You may go ahead and sign in to the app now.
de: Dein Passwort wurde gesetzt. Du kannst dich jetzt anmelden.

source: You're receiving this email because you requested a password reset for your user account for the app %(name)s.
de: Du erhältst diese E-Mail, weil du ein neues Passwort für deinen Account bei der App %(name)s angefordert hast.

source: Please go to the following page and choose a new password:
de: Bitte gehe zu nachfolgender Seite und lege ein neues Passwort fest:

source: Your username, in case you've forgotten:
de: Dein Benutzername, falls du ihn vergessen hast:

source: Thanks for using our app!
de: Vielen Dank, dass du unsere App benutzt!

source: The %(site_name)s team
de: Das Team von %(site_name)s

source: %(name)s: Reset Password
de: %(name)s: Passwort zurücksetzen

source: no choices found
de: keine Wahlmöglichkeiten gefunden

source: Delete %(verbose_name)s
de: %(verbose_name)s löschen

source: Do you really want to delete %(verbose_name)s?
de: Willst du %(verbose_name)s wirklich löschen?

source: Add selected
de: Ausgewählte hinzufügen

source: Signed in
de: Angemeldet

source: Signed out
de: abmelden

source: You are signed in as %(user)s
de: Du bist als %(user)s angemeldet

source: You are signed out
de: Du bist abgemeldet

source: Sign in
de: Anmelden

source: I forgot my password.
de: Ich habe mein Passwort vergessen

source: No account yet ?
de: Noch keinen Account ?

source: register
de: registrieren

source: You have to use your new password the next time you log in.
de: Bei der nächsten Anmeldung musst du dein neues Passwort benutzen.

source: Please enter your old password, for security's sake, and then enter your new password twice so we can verify you typed it in correctly.
de: Bitte gib aus Sicherheitsgründen dein altes Passwort ein. Danach musst du zweimal dein neues Passwort eingeben, damit wir verifizieren können, dass du es korrekt eingegeben hast.

source: Change my password
de: Passwort ändern

source: Your password has been set. You may go ahead and sign in now.
de: Dein Passwort wurde gesetzt. Du kannst dich jetzt anmelden.

source: Please enter your new password twice so we can verify you typed it in correctly.
de: Bitte gib dein neues Passwort zweimal ein, damit wir verifizieren können, dass du es korrekt eingegeben hast.

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
de: Der Link für das Zurücksetzen des Passwortes war ungültig. Vermutlich, weil er bereits benutzt wurde. Bitte fordere das Zurücksetzen des Passwortes neu an.

source: You're receiving this email because you requested a password reset for your user account at %(site_name)s.
de: Du erhältst diese E-Mail, weil du angefordert hast, deinn Passwort auf %(site_name)s zurückzusetzen.

source: Thanks for using our site!
de: Vielen Dank, dass du unsere App benutzt!

source: Setup superuser account
de: Superuser Account erstellen

source: Create superuser account
de: Superuser Account erstellen

source: Manage taxonomic restriction
de: Taxonomische Restriktionen verwalten

source: You have to publish your app before being able to set taxonomic restrictions
de: Du musst deine App veröffentlichen, bevor du Taxonomische Restriktionen festlegen kannst.

source: %(name)s is restricted to the following taxa
de: %(name)s ist auf folgende Taxa beschränkt

source: with descendants
de: einschließlich Nachkommen

source: Remove
de: entfernen

source: Usable for all taxa
de: Für alle Taxa benutzbar

source: Add taxonomic restriction
de: Taxonomische Restriktion hinzufügen

source: Add taxon to restriction
de: Taxon zur Restriktion hinzufügen

source: delete
de: löschen
