Repository: pypi-data/pypi-mirror-385
Catalog: packages/flowstrider/flowstrider-1.1.0-py3-none-any.whl/flowstrider/localization/attributes/*/LC_MESSAGES/attributes.po
Languages: de

source: Authentication factors
de: Authentifizierungsfaktoren

source: If authentication is required, which factors will be needed for authentication. Examples: ['PIN', 'Chip Card', 'OTP'] or ['Digital Certificate', 'Biometric Data'].
de: Welche Faktoren zur Authentifizierung benötigt werden, falls eine Authentifizierung erforderlich ist. Beispiele: ['PIN', 'Chip Card', 'OTP'] oder ['Digital Certificate', 'Biometric Data'].

source: Authentication protocol
de: Authentifizierungsprotokoll

source: Which authentication protocol will be used to ensure integrity. Examples: 'DH_CHAP' or 'FCPAP'
de: Welches Authentifizierungsprotokoll zur Gewährleistung der Integrität verwendet wird. Beispiele: 'DH_CHAP' or 'FCPAP'

source: Requires authentication
de: Erfordert Authentifizierung

source: Whether any form of authentication is required to access the entity.
de: Ob für den Zugriff auf die Entität eine Form der Authentifizierung erforderlich ist.

source: Encryption method
de: Verschlüsselungsmethode

source: Which method of encryption will be used to encrypt the data. Examples: 'AES_128' or 'AES_256'
de: Welche Verschlüsselungsmethode für die Daten verwendet wird. Beispiele: 'AES_128' oder 'AES_256'

source: Given permissions
de: Erteilte Berechtigungen

source: Actions the actor is priviliged to perform.
de: Aktionen, die der Akteur ausführen darf.

source: Handles confidential data
de: Behandelt vertrauliche Daten

source: Whether the entity handles confidential data.
de: Ob die Entität vertrauliche Daten verarbeitet.

source: Handles logs
de: Verarbeitet Protokolle

source: Whether the DataStore handles protocol logging data.
de: Ob der DataStore Protokolldaten verarbeitet.

source: Hash function
de: Hash-Funktion

source: Which function will be used to store hashed data. Examples: 'SHA3_256' or 'SHA_512_256'.
de: Welche Funktion zum Speichern von Hash-Daten verwendet wird. Beispiele: 'SHA3_256' oder 'SHA_512_256'.

source: If the HTTP header '{header}' is set appropriately and as restrictive as possible.
de: Ob der HTTP header '{header}' angemessen und so restriktiv wie möglich gesetzt

source: Is SAN fabric
de: Ist SAN-Fabric

source: Defines, if the entity is part of the fabric layer of a storage area network.
de: Gibt an, ob die Entität Teil der Fabric-Schicht eines Speicherbereichsnetzwerks (SAN) ist.

source: Input data
de: Eingabedaten

source: All types of handled data. Example: ['Session IDs', 'User Requests'].
de: Alle Arten von verarbeiteten Daten. Beispiel: ['Session IDs', 'User Requests'].

source: Input validation
de: Eingabevalidierung

source: Defines, if the input data is validated.
de: Gibt an, ob die Eingabedaten validiert sind.

source: Integrity check
de: Integritätsprüfung

source: If an integrity check (such as a check sum) is used, this should note the specific check. Examples: 'check sum' or 'digital certificate'.
de: Wird eine Integritätsprüfung (z.B. eine Prüfsumme) verwendet, ist hier die spezifische Prüfung anzugeben. Beispiele: 'check sum' oder 'digital certificate'.

source: Uses proxy
de: Verwendet Proxy

source: Whether the dataflow is routed through a TLS-proxy
de: Ob der Datenfluss über einen TLS-Proxy geleitet wird

source: Required permissions
de: Erforderliche Berechtigungen

source: Which priviliges are required to interact with the process.
de: Welche Berechtigungen für die Interaktion mit dem Prozess erforderlich sind

source: Signature scheme
de: Signaturschema

source: If a signature scheme is used, this should note the specific scheme. Examples:'RSA' or 'ECDSA' or 'LMS'.
de: Falls ein Signaturschema verwendet wird, sollte hier das spezifische Schema angegeben werden. Beispiele: 'RSA', 'ECDSA' oder 'LMS'.

source: Stores credentials
de: Speichert Anmeldeinformationen

source: Whether the DataStore stores Login Credentials or other authentication data.
de: Ob der DataStore Anmeldeinformationen oder andere Authentifizierungsdaten speichert.

source: Transport protocol
de: Transportprotokoll

source: Which transport protocol the dataflow uses.
de: Welches Transportprotokoll der Datenfluss verwendet.

source: Informs about data collection
de: Informiert über die Datenerfassung

source: If this data subject gets informed in detail about which data is being collected in which way, what is done with collected data and with whom it is shared.
de: Ob die betroffene Person ausführlich darüber informiert wird, welche Daten auf welche Weise erhoben werden, was mit den erhobenen Daten geschieht und an wen sie weitergegeben werden.

source: Data lifecycle policy exists
de: Eine Richtlinie zum Datenlebenszyklus existiert

source: If a policy is defined that concerns the lifecycle management of data, including principles for creation, storage, sharing, usage, archival and destruction of data.
de: ob eine Richtlinie zum Lebenszyklusmanagement von Daten definiert ist, einschließlich Grundsätzen für die Erstellung, Speicherung, Weitergabe, Nutzung, Archivierung und Vernichtung von Daten.

source: Data retention minimized
de: Datenaufbewahrung minimiert

source: If the application stores data only for the time frame necessary to the core functionality. For example no mail addresses are stored of users who already unsubscribed a newsletter.
de: Ob die Anwendung Daten nur für den für die Kernfunktionalität erforderlichen Zeitraum speichert. Bsp.: keine E-Mail-Adressen von Nutzern werden gespeichert, die sich bereits von einem Newsletter abgemeldet haben.

source: Data sharing minimized
de: Datenfreigabe minimiert

source: If the application shares data only with services and external parties who need it for the functionality of the system.
de: Ob die Anwendung Daten nur mit Diensten und externen Parteien teilt, die diese für die Funktionalität des Systems benötigen.

source: Responses disclose information existence
de: Antworten offenbaren die Existenz von Informationen

source: If the entity discloses the existence of information through status messages when the query was wrong or not authenticated. E.g. returning a 'wrong password' error message revealing the existence of the account.
de: Ob die Entität die Existenz von Informationen durch Statusmeldungen preisgibt, obwohl die Anfrage falsch oder nicht authentifiziert war. Bsp.: die Fehlermeldung 'Falsches Passwort' wird zurückgegeben, die die Existenz des Kontos verrät.

source: Handles personal data
de: Verarbeitet personenbezogene Daten

source: Whether the entity handles personal data.
de: Ob die Entität personenbezogene Daten verarbeitet.

source: Handles user data
de: Verarbeitet Benutzerdaten

source: If this entity stores or handles any data from users like messages, texts, files or full user accounts.
de: Ob diese Entität Daten von Nutzern speichert oder verarbeitet, wie z.B.: Nachrichten, Texte, Dateien oder vollständige Nutzerkonten.

source: Is private network
de: Ist ein privates Netzwerk

source: If the inside workings of the trust boundary are private and the network acts like a blackbox sending and receiving data via dedicated interfaces. Internal communication channels would be completely hidden to outside viewers.
de: Ob die internen Abläufe der Vertrauensgrenze privat bleiben und das Netzwerk wie eine Blackbox agiert, die Daten über dedizierte Schnittstellen sendet und empfängt, während interne Kommunikationskanäle für externe Betrachter vollständig verborgen bleiben.

source: Is a user
de: Ist ein Benutzer

source: Whether this interactor node represents human users.
de: Ob dieser Interaktorknoten menschliche Benutzer darstellt.

source: Leaves usage traces
de: Hinterlässt Nutzungsspuren

source: If the application leaves any traces that a user has used the application like log files, traces of temporary files or size of data changing.
de: Ob die Anwendung Spuren hinterlässt, die auf die Nutzung durch Nutzer hinweisen, wie z. B. Protokolldateien, Spuren temporärer Dateien oder Änderungen der Datengröße.

source: Logs access
de: Prokolliert Zugriff

source: If the process logs access by users.
de: Ob der Prozess den Zugriff durch Benutzer protokolliert.

source: Logs receipt
de: Protokolliert Empfang

source: If the process logs the receipt of messages.
de: ob der Prozess den Empfang von Nachrichten protokolliert.

source: Only necessary data analyzed
de: Nur notwendige Daten werden analysiert

source: If the application keeps the analysis of its data to a strictly necessary level and data is not enriched more than it needs to be for the core functionality.
de: Ob die Anwendung die Analyse ihrer Daten auf das unbedingt erforderliche Maß beschränkt und die Daten nicht stärker analysiert werden, als es für die Kernfunktionalität erforderlich ist.

source: Only necessary data collected
de: Nur notwendige Daten erhoben

source: If the application collects only data that is strictly necessary for its core functionality. This includes limiting the amount/size of data collected and the collected data not being more fine-grained than necessary.
de: ob die Anwendung nur die Daten sammelt, die für ihre Kernfunktionalität unbedingt erforderlich sind. Dazu gehört die Begrenzung der Menge/Größe der gesammelten Daten und die Vermeidung einer detaillierteren Erfassung der gesammelten Daten als nötig.

source: Own data access
de: Zugriff auf eigene Daten

source: If data subjects have access to their own personal data.
de: Ob betroffene Personen Zugriff auf ihre eigenen personenbezogenen Daten haben.

source: Own data modification
de: Änderung der eigenen Daten

source: If data subjects have the ability to correct or delete their own personal data.
de: Ob betroffene Personen die Möglichkeit haben, ihre personenbezogenen Daten zu korrigieren oder zu löschen.

source: Personal data preferences
de: Präferenzen für personenbezogene Daten

source: Whether or not this data subject is given the option to set their preferences regarding the collection, handling and sharing of their personal data.
de: Ob die betroffenen Personen die Möglichkeit haben, ihre Präferenzen hinsichtlich der Erhebung, Verarbeitung und Weitergabe ihrer personenbezogenen Daten festzulegen.

source: Privacy regulation compliance
de: Einhaltung der Datenschutzbestimmungen

source: If this entity is compliant with privacy regulations of jurisdictions the system is used in.
de: Ob diese Entität die Datenschutzbestimmungen der Rechtsordnungen einhält, in denen das System verwendet wird.

source: Privacy standards compliance
de: Einhaltung von Datenschutzstandards

source: If the system is compliant with (industry specific) privacy standards and best practices.
de: Ob das System (branchenspezifischen) Datenschutzstandards und bewährten Verfahren entspricht.

source: Security standards compliance
de: Einhaltung von Sicherheitsstandards

source: If the system is compliant with (industry specific) security standards and best practices.
de: Ob das System (branchenspezifischen) Sicherheitsstandards und bewährten Verfahren entspricht.

source: Stores signed data
de: Speichert signierte Daten

source: If the data store stores data that has been digitally signed by the uploader.
de: Ob der Datenspeicher Daten speichert, die vom Uploader digital signiert wurden.

source: Stores user associated metadata
de: Speichert benutzerbezogene Metadaten

source: If the data store stores metadata, hidden data or specific patterns that could relate to specific users.
de: Ob der Datenspeicher Metadaten, versteckte Daten oder bestimmte Muster speichert, die sich auf bestimmte Nutzer beziehen könnten.

source: Transmits signed data
de: Überträgt signierte Daten

source: If the dataflow transmits data that has been digitally signed by the sender. Example: signed emails.
de: Ob der Datenfluss Daten überträgt, die vom Absender digital signiert wurden. Beispiel: signierte E-Mails.

source: Transmits unique user identifier
de: Überträgt eine eindeutige Benutzerkennung

source: If an identifier is transmitted on this dataflow that uniquely corresponds to one user. Examples: IP-address, email-address, unique pseudonyms
de: Ob in diesem Datenfluss eine Kennung übertragen wird, die eindeutig einem Nutzer zugeordnet ist. Beispiele: IP-Adresse, E-Mail-Adresse, eindeutige Pseudonyme.

source: Transmits user data
de: Überträgt Benutzerdaten

source: If this dataflow transmits any data directly from users like messages, texts or files.
de: Ob dieser Datenfluss Daten direkt von Nutzern überträgt, wie z. B. Nachrichten, Texte oder Dateien.

source: Transmits user identity
de: Überträgt Benutzeridentität

source: If this dataflow transmits the clear identity of users such as the full name.
de: Ob dieser Datenfluss die eindeutige Identität der Nutzer, beispielsweise den vollständigen Namen, übermittelt.

source: Transmits user properties
de: Überträgt Benutzereigenschaften

source: If this dataflow transmits any properties that are dependent on the user like OS, browser, screen size, language, etc.
de: Ob dieser Datenfluss benutzerabhängige Eigenschaften wie Betriebssystem, Browser, Bildschirmgröße, Sprache usw. überträgt,
