Repository: pypi-data/pypi-mirror-385
Catalog: packages/wagtailmedia/wagtailmedia-0.17.2.tar.gz/wagtailmedia-0.17.2/src/wagtailmedia/locale/*/LC_MESSAGES/django.po
Languages: ro

source: Collection
ro: Colecția

source: Add
ro: Adaugă

source: Add/edit media you own
ro: Adaugă/editează conținut media pe care îl dețineți

source: Edit
ro: Editează

source: Edit any media
ro: Editează orice conținut media

source: Audio file
ro: Fișier audio

source: Video file
ro: Fișier video

source: title
ro: titlu

source: file
ro: fișier

source: duration
ro: durată

source: Duration in seconds
ro: Durata în secunde

source: width
ro: lățime

source: height
ro: înălțime

source: thumbnail
ro: miniatură

source: created at
ro: creat la

source: uploaded by user
ro: încărcat de utilizatorul

source: tags
ro: etichete

source: Search
ro: Caută

source: Upload Audio
ro: Încarcă audio

source: Upload Video
ro: Încarcă video

source: Popular tags
ro: Etichete populare

source: Uploading…
ro: Se încarcă

source: Upload
ro: Încarcă

source: There is one match
ro: Există o potrivire

source: Latest media
ro: Conținut media recent

source: Sorry, no media files match "<em>%(query_string)s</em>"
ro: Ne pare rău, "<em>%(query_string)s</em>" nu se potrivește cu nici un fișier media

source: You haven't uploaded any media in this collection. Why not <a href="%(wagtailmedia_add_url)s">upload one now</a>?
ro: Nu ați încărcat nici un conținut media în această colecție. De ce să nu <a href="%(wagtailmedia_add_url)s">adăugați ceva conținut acum</a>?

source: You haven't uploaded any media. Why not <a href="%(wagtailmedia_add_url)s">upload one now</a>?
ro: Nu ați încărcat nici un conținut media. De ce să nu <a href="%(wagtailmedia_add_url)s">încărcați ceva conținut acum</a>?

source: <span>%(total)s</span> Media file <span class="visuallyhidden w-sr-only">created in %(site_name)s</span>
ro: <span>%(total)s</span> fișier media <span class="visuallyhidden w-sr-only">creat în %(site_name)s</span>

source: Change media file:
ro: Schimbă fișier media:

source: Add audio
ro: Adaugă audio

source: Add video
ro: Adaugă video

source: Add audio or video
ro: Adaugă audio sau video

source: Delete %(title)s
ro: Șterge %(title)s

source: Delete media file
ro: Șterge fișier media

source: Used %(usage_count)s time
ro: %(usage_count)s utilizare

source: Are you sure you want to delete this media file?
ro: Sigur doriți să ștergeți acest fișier media?

source: Yes, delete
ro: Da, șterge

source: No, don't delete
ro: Nu, nu șterge

source: Editing %(title)s
ro: Editează %(title)s

source: Editing
ro: Editare

source: Save
ro: Salvează

source: Delete
ro: Șterge

source: Filesize
ro: Mărime fișier

source: File not found
ro: Fișierul nu a fost găsit

source: Usage
ro: Utlizare

source: Media
ro: Conținut media

source: Popular Tags:
ro: Etichete populare

source: Clear
ro: Curăță

source: Title
ro: TItlu

source: File
ro: Fișier

source: Type
ro: Tip

source: Uploaded
ro: Încărcat

source: There is %(counter)s match
ro: Există %(counter)s potrivire

source: You haven't uploaded any media files in this collection. You can upload <a href="%(wagtailmedia_add_audio_url)s">audio</a> or <a href="%(wagtailmedia_add_video_url)s">video</a> files.
ro: Nu ați încărcat nici un conținut media în această colecție. De ce să nu adăugați <a href="%(wagtailmedia_add_audio_url)s">audio</a> sau <a href="%(wagtailmedia_add_video_url)s">video</a>?

source: You haven't uploaded any media files. You can upload <a href="%(wagtailmedia_add_audio_url)s">audio</a> or <a href="%(wagtailmedia_add_video_url)s">video</a> files.
ro: Nu ați încărcat nici un conținut media. De ce să nu adăugați <a href="%(wagtailmedia_add_audio_url)s">audio</a> sau <a href="%(wagtailmedia_add_video_url)s">video</a>?

source: Usage of %(title)s
ro: Utilizare %(title)s

source: Usage of
ro: Utilizare

source: Field
ro: Câmp

source: Media permissions
ro: Permisiuni media

source: Add a media permission
ro: Adaugă permisiune media

source: Your browser does not support the audio element.
ro: Browserul dvs. nu acceptă elementul audio.

source: Your browser does not support the video element.
ro: Browserul dvs. nu acceptă elementul video.

source: Choose audio
ro: Alege audio

source: Choose video
ro: Alege video

source: Choose a media item
ro: Alege conținut media

source: Search media files
ro: Caută fișiere media

source: Search media
ro: Caută conținut media

source: Media file '{0}' added.
ro: Fișierul media '{0}' a fost adăugat.

source: The media file could not be saved due to errors.
ro: Fișierul media nu a fost salvat din cauza erorilor.

source: Media file '{0}' updated
ro: Fișierul media '{0}' a fost actualizat.

source: The media could not be saved due to errors.
ro: Conținutul media nu a fost salvat din cauza erorilor.

source: The file could not be found. Please change the source or delete the media file
ro: Fișierul nu a fost găsit. Vă rugăm să schimbați sursa sau să ștergeți conținutul media

source: Media file '{0}' deleted.
ro: Fișierul media '{0}' a fost șters.

source: (Private %s)
ro: (%s privat)

source: Edit this %s
ro: Editează %s

source: %(count)s media file
ro: %(count)s fișier media

source: Choose another media item
ro: Alege alt conținut media

source: Edit this media item
ro: Editează acest element

source: Choose another audio item
ro: Alege alt conținut audio

source: Edit this audio item
ro: Editează acest conținut audio

source: Choose another video
ro: Alege alt video

source: Edit this video
ro: Editează acest video
