# Cisco Nexus
start_mode: enable
hostname: nxos
line_feed: "\r\n"
enable_password: ""
modes:
  enable:
    prompt: "# "
    switch_mode_cmds:
      - "configure terminal"
      - "exit"
    cmds: []
  config:
    prompt: "(config)# "
    switch_mode_cmds:
      - "exit"
      - "end"
    cmds:
    - cmd: "hostname nxos"
      output: ""
    - cmd: "copy running-config startup-config"
      output: |
        [########################################] 100%
        Copy complete, now saving to disk (please wait)...
        Copy complete.
common:
  - cmd: "show version"
    output: |
      Cisco Nexus Operating System (NX-OS) Software
      TAC support: http://www.cisco.com/tac
      Documents: http://www.cisco.com/en/US/products/ps9372/tsd_products_support_series_home.html
      Copyright (c) 2002-2018, Cisco Systems, Inc. All rights reserved.
      The copyrights to certain works contained herein are owned by
      other third parties and are used and distributed under license.
      Some parts of this software are covered under the GNU Public
      License. A copy of the license is available at
      http://www.gnu.org/licenses/gpl.html.

      Nexus 9000v is a demo version of the Nexus Operating System

      Software
        BIOS: version
        NXOS: version 7.0(3)I7(4)
        BIOS compile time:
        NXOS image file is: bootflash:///nxos.7.0.3.I7.4.bin
        NXOS compile time:  6/14/2018 2:00:00 [06/14/2018 09:49:04]


      Hardware
        cisco Nexus9000 9000v Chassis
         with 8129576 kB of memory.
        Processor Board ID 9RFOYRP1UDR

        Device name: nxos-60-100
        bootflash:    3509454 kB
      Kernel uptime is 0 day(s), 0 hour(s), 7 minute(s), 57 second(s)

      Last reset
        Reason: Unknown
        System version:
        Service:

      plugin
        Core Plugin, Ethernet Plugin

  - cmd: "terminal length 0"
    output: ""
welcome: |
  Warning: Permanently added '192.168.60.100' (RSA) to the list of known hosts.
  User Access Verification
  (admin@192.168.60.100) Password:

  Bad terminal type: "xterm-256color". Will assume vt100.
  Cisco NX-OS Software
  Copyright (c) 2002-2018, Cisco Systems, Inc. All rights reserved.
  Nexus 9000v software ("Nexus 9000v Software") and related documentation,
  files or other reference materials ("Documentation") are
  the proprietary property and confidential information of Cisco
  Systems, Inc. ("Cisco") and are protected, without limitation,
  pursuant to United States and International copyright and trademark
  laws in the applicable jurisdiction which provide civil and criminal
  penalties for copying or distribution without Cisco's authorization.

  Any use or disclosure, in whole or in part, of the Nexus 9000v Software
  or Documentation to any third party for any purposes is expressly
  prohibited except as otherwise authorized by Cisco in writing.
  The copyrights to certain works contained herein are owned by other
  third parties and are used and distributed under license. Some parts
  of this software may be covered under the GNU Public License or the
  GNU Lesser General Public License. A copy of each such license is
  available at
  http://www.gnu.org/licenses/gpl.html and
  http://www.gnu.org/licenses/lgpl.html
  ***************************************************************************
  *  Nexus 9000v is strictly limited to use for evaluation, demonstration   *
  *  and NX-OS education. Any use or disclosure, in whole or in part of     *
  *  the Nexus 9000v Software or Documentation to any third party for any   *
  *  purposes is expressly prohibited except as otherwise authorized by     *
  *  Cisco in writing.                                                      *
  ***************************************************************************

invalid_cmd_error: |
  ^
  % Invalid command at '^' marker.
