Repository: pypi-data/pypi-mirror-385
Catalog: packages/django-richmin/django-richmin-0.2.5.tar.gz/django-richmin-0.2.5/richmin/locale/*/LC_MESSAGES/django.po
Languages: fa

source: First, enter a username and password. Then, you'll be able to edit more user options.
fa: ابتدا، یک نام کاربری و گذرواژه وارد کنید. سپس، شما می توانید موارد دیگری را ویرایش کنید.

source: Account
fa: حساب کاربری

source: See Profile
fa: مشاهده پروفایل

source: Dashboard
fa: میزکار

source: richmin version
fa: نسخه richmin

source: All rights reserved.
fa: همه حقوق محفوظ است.

source: UI Configuration
fa: تنظیمات رابط کاربری

source: Copy this info your settings file to persist these UI changes
fa: این مشخصات را در فایل تنظیمات خود کپی کنید تا این تغییرات رابط کاربری اعمال شود

source: Confirm Import
fa: تایید Import

source: Actions
fa: عملیات ها

source: Some rows failed to validate
fa: اعتبارسنجی بعضی از سطر ها ناموفق بود

source: Please correct these errors in your data where possible, then reupload it using the form above.
fa: لطفا این خطاها را در دیتای خود اصلاح کنید، سپس دوباره به وسیله فرم بالا آپلود کنید.

source: Row
fa: سطر

source: Non field specific
fa: زمینه غیر خاص

source: %(timesince)s ago
fa: %(timesince)s قبل

source: This object doesn't have a change history. It probably wasn't added via this admin site.
fa: این آبجکت تاریخچه تغییرات ندارد. ممکن است توسط این سایت مدیریت اضافه نشده باشد.

source: Popup closing...
fa: بسته شدن پاپ آپ...

source: General
fa: کلی

source: Please enter your old password, for security's sake, and then enter your new password twice so we can verify you typed it in correctly.
fa: لطفا گذرواژه قبلی خود را وارد کنید، برای ملاحظات امنیتی، و سپس گذرواژه جدید خود را دو بار وارد کنید که ما درستی آن را تشخیص دهیم.

source: Deleted “{object}”.
fa: حذف شده “{object}”.

source: Could not reverse url from {instance}
fa: نشانی وب از {instance} برگردانده نشد
