Repository: pypi-data/pypi-mirror-385
Catalog: packages/share-links/share_links-1.1.0-py3-none-any.whl/share_links/apps/share_links_comments/locale/*/LC_MESSAGES/django.po
Languages: fr

source: User infos
fr: Infos de l'utilisateur

source: Link infos
fr: Infos du lien

source: Link url
fr: URL du lien

source: Nb of link comments
fr: Nombre de commentaires sur le lien

source: Comment URL
fr: URL du commentaire

source: Link/Title
fr: Lien/Titre

source: Moderate comments
fr: Modération des commentaires

source: Thank you for your comment. It will be moderated and published soon.
fr: Merci pour votre commentaire. Il va être modéré et publié d'ici peu.

source: Comments must be written using <a href="https://daringfireball.net/projects/markdown/basics">Markdown</a>.
fr: Les commentaires peuvent être écrits en <a href="https://daringfireball.net/projects/markdown/basics">Markdown</a>.

source: Supported tags are: a, p, i, b, img, ul, ol, li, code, pre, em, strong, blockquote, br.
fr: Les tags supportés sont: a, p, i, b, img, ul, ol, li, code, pre, em, strong, blockquote, br.

source: This comment was moderated.
fr: Ce commentaire a été modéré.
