Repository: pypi-data/pypi-mirror-385
Catalog: packages/share-links/share_links-1.1.0-py3-none-any.whl/share_links/locale/*/LC_MESSAGES/django.po
Languages: fr

source: About page
fr: Page à propos

source: Contact page
fr: Page de contact

source: You can only create two "AboutContactPages" instances (first is About page, second is Contact page), and you can't delete any of them! If you know what you're doing, you can still add/delete objects using the model directly (not the admin like now).
fr: Vous ne pouvez créer que deux instances de "AboutContactPages" (la première est la page À propos et la seconde est la page de Contact), et vous ne pouvez pas les supprimer! Si vous savez ce que vous faites vous pouvez toujours créer/supprimer des instances en passant par le modèle directement (et pas la section d'administration).

source: How to handle updates?
fr: Comment gérer les mises à jour automatiques ?

source: Save file
fr: Sauvegarder le fichier

source: File exist?
fr: Le fichier existe ?

source: Title
fr: Titre

source: Add tags to current selection
fr: Ajout des tags à la sélection

source: {len(links)} links where updated with the new tags {', '.join([str(tag) for tag in tags])}.
fr: {len(links)} liens ont été mis à jour avec l'ajout des tags {', '.join([str(tag) for tag in tags])}.

source: Link nb
fr: Nombre de liens

source: Tag nb
fr: Nb de tags

source: is online?
fr: est en ligne ?

source: Online
fr: En ligne

source: Offline
fr: Hors ligne

source: has at least one tag
fr: a au moins un tag

source: At least one tag
fr: Au moins un tag

source: No tag
fr: Pag de tag

source: random
fr: aléatoire

source: Random
fr: Aléatoire

source: Highlighted
fr: Mis en avant

source: Added by
fr: Ajouté par

source: Date added
fr: Date d'ajout

source: Language
fr: Langue

source: Is online
fr: Est en ligne

source: Has comments
fr: A des commentaires

source: No language
fr: Pas de langue

source: Tag name
fr: Nom du tag

source: Search
fr: Recherche

source: Link
fr: Lien

source: You can use markdown here.
fr: Vous pouvez utiliser du markdown ici.

source: Link will be displayed with a special color, and will appear in the "highlighted" sort option.
fr: Les liens vont être affichés avec une couleur spéciale, et vont apparaître dans le tri "mis en avant".

source: Upload pdf or screenshot of the page. If this field is empty and USE_WEASYPRINT is set to True (currently set to {USE_WEASYPRINT}), then the pdf will be auto-generated using weasyprint.
fr: Héberger un pdf ou un screenshot de la page. Si ce champ est vide etque USE_WEASYPRINT est égal à True (sa valeur actuelle est {USE_WEASYPRINT}), alors le pdf va être auto-généré en utilisant weasyprint.

source: Uncheck this box if you don't want the file to be auto-generated.
fr: Décochez cette case si vous ne voulez pas qu'un fichier soit auto-généré.

source: Uncheck this box if the link is not online anymore (will provide the web archive link instead of the original link).
fr: Décochez cette case si le lien visé n'est plus accessible (cette action va remplacer le lien par un lien web archive).

source: Allow override title?
fr: Autoriser la mise à jour automatique du titre ?

source: Management commands will try to fetch the title from the website &lt;title&gt; tag.
fr: Les commandes automatiques vont pouvoir tenter de mettre à jour le titre du site à partir du tag html &lt;title&gt;.

source: Allow override language?
fr: Autoriser la mise à jour automatique de la langue ?

source: Management commands will try to fetch the language from the lang attribute.
fr: Les commandes automatiques vont pouvoir tenter de mettre à jour la langue du site à partir de l'attribut lang.

source: Links
fr: Liens

source: Category
fr: Catégorie

source: Categories
fr: Catégories

source: Tag will be displayed with a special color, and will appear in the "highlighted" sort option.
fr: Les tags vont être affichés avec une couleur spéciale, et vont apparaître dans le tri "mis en avant".

source: About & Contact Pages
fr: Pages À propos & Contact

source: Name
fr: Nom

source: The name of the collection.
fr: Le nom de la collection.

source: Collection will be displayed with a special color, and will appear in the "highlighted" sort option.
fr: La collection va être affichée avec une couleur spéciale, et va apparaître dans le tri "mis en avant".

source: You can use markdown here. If the description is empty, the link description will be used (if it exists).
fr: Vous pouvez utiliser du markdown ici. Si la description est vide, la description du lien va être utilisée à la place (si elle existe).

source: Add tags to multiple links
fr: Ajouter des tags à plusieurs liens

source: Submit
fr: Valider

source: a share-links instance.
fr: une instance de share-links.

source: About
fr: À propos

source: Random link!
fr: Lien aléatoire !

source: Manage content
fr: Gérer

source: Search:
fr: Recherche:

source: %(site_name)s, because sharing links and keeping track of them should be easy!
fr: %(site_name)s, parce que partager et garder une trace des liens devrait être simple !

source: Statistics
fr: Statistiques

source: Apply
fr: Changer

source: <i>Share Links</i> %(get_version)s, the tool used behind this site, is open source! <a href="https://gitlab.com/sodimel/share-links">Go check the code</a>!
fr: <i>Share Links</i> %(get_version)s, l'outil derrière ce site, est open-source ! <a href="https://gitlab.com/sodimel/share-links">Venez voir le code</a> !

source: The only data stored are server logs, and informations you submit using the comment system.
fr: Les seules données stockées sont les logs serveur, et les informations que vous pouvez soummettre en utilisant le système de commentaires.

source: Contact the owner of the site
fr: Contactez le propriétaire du site

source: All tags in this category
fr: Tous les tags dans cette catégorie

source: Added
fr: Ajouté

source: link
fr: lien

source: No tags in this category.
fr: Aucun tag dans cette catégorie.

source: No link in this collection!
fr: Aucun lien dans cette collection !

source: List of collections
fr: Liste des collections

source: There's no collection yet!
fr: Il n'y a pas de collection pour l'instant !

source: Saved file
fr: Fichier sauvegardé

source: %(comment_count)s comment.
fr: %(comment_count)s commentaire.

source: This link is likely not available on the web, it has been replaced by a web archive link.
fr: Ce lien n'est vraisemblablement plus disponible sur internet, il a été remplacépar un lien menant vers une archive.

source: offline
fr: hors ligne

source: by
fr: par

source: %(comments_nb)s comment
fr: %(comments_nb)s commentaire

source: List of links
fr: Liste des liens

source: There's no link (yet)!
fr: Il n'y a pas de lien pour l'instant !

source: Latest comments
fr: Derniers commentaires

source: Posted on
fr: Posté sur

source: This comment was moderated.
fr: Ce commentaire a été modéré.

source: Some stats for %(site_name)s (the greatest instance of share-links of all time):
fr: Quelques stats concernant %(site_name)s (la meilleure instance de share-links de tous les temps):

source: Number of links:
fr: Nombre de liens :

source: All from
fr: Tous ajoutés par

source: By languages:
fr: Par langues :

source: There's
fr: Il y a

source: links in language
fr: liens dans la langue

source: ... And
fr: ... Et

source: where language is not defined
fr: où la langue n'est pas définie

source: Number of comments:
fr: Nombre de commentaires:

source: Number of tags:
fr: Nombre de tags :

source: Most used tag:
fr: Tag le plus utilisé :

source: used %(nb)s times
fr: utilisé %(nb)s fois

source: There's no tag yet!
fr: Il n'y a pas de tag pour l'instant !

source: PREVIOUS
fr: PRÉCÉDENT

source: RANDOM
fr: ALÉATOIRE

source: NEXT
fr: SUIVANT

source: <div > <p> You are on the webring listing all instances of share-links that have been added to the file by their respective owners. Each Link takes you to another site. "Previous" and "Next" take you to the "neighboring" instances of this site, and "Random" takes you to a random instance in the list. </p> <p class="opacity"> Currently, the webring has <b>%(nb)s</b> instance%(nb|pluralize)s. </p> </div>
fr: <div class="detail-item margins-item"> <p> Vous vous trouvez sur le webring qui liste toutes les instances de share-links qui ont été ajoutées au fichier par leurs propriétaires respectifs. Chaque Lien vous emmène vers une de ces instances. "Précédent" et "Suivant" vous emmènent vers les instances "voisines" de ce site, et "Aléatoire" vous emmène vers une instance aléatoire de la liste. </p> <p class="opacity smaller"> Actuellement, le webring contient <b>%(nb)s</b> instance%(nb|pluralize)s. </p> </div>

source: There are no "Previous" & "Next" links in this page because this instance of share-links cannot be found on the webring.json file on the repo.
fr: Il n'y a pas de lien "Précédent" & "Suivant" sur cette page, parce que cette instance de share-links n'a pas été trouvée dans le fichier webring.json dans le repo.

source: <b>How to add my site?</b><br />If you have an instance running, just add yourself in the <a class='color-link' href='https://gitlab.com/sodimel/share-links/-/blob/main/webring.json'><code>webring.json</code></a> file and submit a merge request (you can also submit your instance in an issue).
fr: <b>Comment rajouter mon site ?</b><br />Si vous avez une instance qui tourne quelque part, ajoutez simplement ses infos dans le fichier <a class='color-link' href='https://gitlab.com/sodimel/share-links/-/blob/main/webring.json'><code>webring.json</code></a> et lancez une Merge Request (vous pouvez aussi simplement soumettre les informations dans une issue sur le repo).

source: Show all the links in the webring
fr: Montrer tous les liens du webring

source: first
fr: première

source: previous
fr: précédente

source: Page %(current)s of %(total)s
fr: Page %(current)s/%(total)s

source: next
fr: suivante

source: last
fr: dernière

source: Apply filters
fr: Appliquer les filtres

source: Subcategory of
fr: Sous-catégorie de

source: RSS feeds
fr: Flux RSS

source: You can subscribe to some RSS feeds on this page:
fr: Vous pouvez accéder aux flux RSS depuis cette page :

source: new links & tags
fr: nouveaux liens & tags

source: new links only
fr: nouveau liens uniquement

source: new tags only
fr: nouveau tags uniquement

source: Results for
fr: Résultats pour

source: Use the magnifying glass icon at the top right of the screen in order to make your request.
fr: Utilisez l'icône de la loupe en haut à droite de l'écran pour lancer une recherche.

source: Queries are processed for words that are at least %(request_min_chars)s characters long, in order to reduce server load. <i>Sorry words & tags < %(request_min_chars)s long!</i>
fr: La recherche est effectuée pour les requêtes qui ont au moins %(request_min_chars)s caractères de long, afin de réduire la charge du serveur. <i>Désolé les mots & les tags < %(request_min_chars)s caractères !</i>

source: No link was found.
fr: Aucun lien n'a été trouvé.

source: No tag was found.
fr: Aucun tag n'a été trouvé.

source: No link with this tag!
fr: Aucun lien avec ce tag !

source: List of tags
fr: Liste des tags

source: This page is in {lang}.
fr: Cette page est en {lang}.

source: Favicon of
fr: Favicon de

source: search/
fr: recherche/

source: rss/new/all/
fr: rss/nouveaux/tous/

source: rss/new/links/
fr: rss/nouveaux/liens/

source: rss/new/tags/
fr: rss/nouveaux/tags/

source: about/
fr: a-propos/

source: statistics/
fr: statistiques/

source: get-title/
fr: récupérer-titre/

source: get-lang/
fr: récupérer-langue/

source: link/<int:pk>/
fr: lien/<int:pk>/

source: domain-name/<str:domain_name>/
fr: nom-de-domaine/<str:domain_name>/

source: random/
fr: aléatoire/

source: Got a HTTP status of 404, Not found. The page does not exist anymore.
fr: Le scraper a reçu un code HTTP 404, Not found. La page n'existe plus.

source: Got a HTTP status of 406, Not Acceptable. It seems that this page does not really like scrapping, you're gonna take the data yourself.
fr: Le scraper a reçu un code HTTP 406, Not Acceptable. On dirait que ce site n'aime pas vraiment les scrapers, vous allez devoir récupérer les données vous-même.

source: Got a HTTP status of 410, Gone. The resource is likely not available anymore.
fr: Le scraper a reçu un code HTTP 410, Gone. La ressource n'est sûrement plus disponible.

source: Unknown error, HTTP code {e.code}.
fr: Erreur inconnue, code HTTP {e.code}.

source: Url is unreachable.
fr: L'URL n'est pas accessible.

source: Got an empty title, you'll need to be creative!
fr: On a récupéré un titre vide, vous allez devoir être créatif !

source: Lang attribute found does not match any of available value in LANGUAGE_CHOICES.
fr: L'attribut lang trouvé ne correspond à aucune des valeurs disponibles dans LANGUAGES_CHOICES.

source: Cannot find a lang attribute.
fr: Impossible de trouver un attribut lang.

source: All links for domain
fr: Tous les liens pour le domaine

source: Error: no url supplied.
fr: Erreur : aucune URL fournie.

source: New links & tags
fr: Nouveaux liens & tags

source: Creation of links and tags.
fr: Création des liens & des tags

source: New links
fr: Nouveaux liens

source: Creation of links.
fr: Création des liens

source: New tags
fr: Nouveaux tags

source: Creation of tags.
fr: Création des tags
