Repository: pypi-data/pypi-mirror-385
Catalog: packages/invenio-oauth2server/invenio_oauth2server-3.3.1.tar.gz/invenio_oauth2server-3.3.1/invenio_oauth2server/translations/*/LC_MESSAGES/messages.po
Languages: fi

source: OAuth Applications
fi: OAuth-sovellukset

source: User Management
fi: Käyttäjähallinta

source: OAuth Application Tokens
fi: OAuth-sovellustunnukset

source: %(icon)s Applications
fi: %(icon)s sovellukset

source: Invalid redirect URIs: %(urls)s
fi: Virheelliset uudelleenohjaus-URI:t: %(urls)s

source: Redirect URIs (one per line)
fi: Uudelleenohjaus-URI:t (yksi per rivi)

source: One redirect URI per line. This is your application's authorization callback URLs. HTTPS must be used for all hosts except localhost (for testing purposes).
fi: Yksi uudelleenohjaus-URI per rivi. Nämä ovat sovelluksesi valtuutuksen paluukutsu-osoitteita. HTTPS-yhteyttä on käytettävä kaikilla isännillä paitsi localhostissa (testaustarkoituksiin).

source: Client type
fi: Asiakastyyppi

source: Select confidential if your application is capable of keeping the issued client secret confidential (e.g. a web application), select public if your application cannot (e.g. a browser-based JavaScript application). If you select public, your application MUST validate the redirect URI.
fi: Valitse luottamuksellinen, jos sovelluksesi pystyy säilyttämään annetun client secretin salassa (esim. verkkosovellus); valitse julkinen, jos ei pysty (esim. selaimessa toimiva JavaScript-sovellus). Jos valitset julkinen, sovelluksesi TÄYTYY validoida uudelleenohjaus-URI.

source: Confidential
fi: Luottamuksellinen

source: Public
fi: Julkinen

source: Token name
fi: Tunnuksen nimi

source: Name of personal access token.
fi: Henkilökohtaisen käyttöoikeustunnuksen nimi.

source: The name must be less than 40 characters long.
fi: Nimen on oltava alle 40 merkkiä pitkä.

source: Scopes
fi: Käyttöoikeuslaajuudet

source: Scopes assign permissions to your personal access token. A personal access token works just like a normal OAuth access token for authentication against the API.
fi: Laajuuksilla määritetään henkilökohtaisen käyttöoikeustunnuksesi oikeudet. Henkilökohtainen käyttöoikeustunnus toimii kuten tavallinen OAuth-käyttöoikeustunnus API:ta vasten todennuksessa.

source: Name
fi: Nimi

source: Name of application (displayed to users).
fi: Sovelluksen nimi (näytetään käyttäjille).

source: Description
fi: Kuvaus

source: Optional. Description of the application (displayed to users).
fi: Valinnainen. Sovelluksen kuvaus (näytetään käyttäjille).

source: Website URL
fi: Verkkosivun URL-osoite

source: URL of your application (displayed to users).
fi: Sovelluksesi URL-osoite (näytetään käyttäjille).

source: Allow access to email address (read-only).
fi: Salli pääsy sähköpostiosoitteeseen (vain luku).

source: Authorize application
fi: Valtuuta sovellus

source: Application '%(client_name)s' by '%(client_user)s' wants permission to access your '%(current_user)s' account.
fi: Sovellus '%(client_name)s' (tekijä '%(client_user)s') pyytää lupaa käyttää tiliäsi '%(current_user)s'.

source: Review permissions
fi: Tarkastele oikeuksia

source: No permissions granted.
fi: Oikeuksia ei myönnetty.

source: Application
fi: Sovellus

source: Visit application website
fi: Vieraile sovelluksen sivustolla

source: Reject
fi: Hylkää

source: Invalid authorization request
fi: Virheellinen valtuutuspyyntö

source: The service that redirected your here made an invalid authorization request (error code: %(x_error)s).
fi: Palvelu, josta sinut ohjattiin tänne, teki virheellisen valtuutuspyynnön (virhekoodi: %(x_error)s).

source: Get me out of here!
fi: Vie minut pois täältä!

source: New OAuth Application
fi: Uusi OAuth-sovellus

source: Cancel
fi: Peruuta

source: Register
fi: Rekisteröi

source: Application / %(client_name)s
fi: Sovellus / %(client_name)s

source: Client ID
fi: Asiakastunnus

source: Client Secret
fi: Asiakassalaisuus

source: Do not share the client secret with anyone!
fi: Älä jaa asiakassalaisuutta kenellekään!

source: Reset client secret
fi: Nollaa asiakassalaisuus

source: Delete
fi: Poista

source: Save
fi: Tallenna

source: OAuth 2.0 Endpoints
fi: OAuth 2.0 -päätepisteet

source: Authorize URL (GET)
fi: Valtuutus-URL (GET)

source: Query parameters
fi: Kyselyparametrit

source: example request
fi: esimerkkipyyntö

source: required, use
fi: pakollinen, käytä

source: required
fi: pakollinen

source: required, space separate list of scopes
fi: pakollinen, välilyönnillä eroteltu luettelo käyttöoikeuslaajuuksista

source: required, URL encoded
fi: pakollinen, URL-enkoodattu

source: recommended, for CSRF protection
fi: suositeltu, CSRF-suojaukseen

source: Access token URL (POST)
fi: Käyttöoikeustunnuksen URL (POST)

source: Request body parameters:
fi: Pyynnön rungon parametrit:

source: required for grant_type
fi: pakollinen myöntämistyypille

source: Developer Applications
fi: Kehittäjäsovellukset

source: New application
fi: Uusi sovellus

source: You have registered these applications to use the %(site_name)s API:
fi: Olet rekisteröinyt seuraavat sovellukset käyttämään %(site_name)s-rajapintaa:

source: You have not yet registered any applications. Click the 'New application' button to create an application to access the %(site_name)s API.
fi: Et ole vielä rekisteröinyt yhtään sovellusta. Luo sovellus pääsyä varten %(site_name)s-rajapintaan napsauttamalla 'Uusi sovellus'.

source: Personal access tokens
fi: Henkilökohtaiset käyttöoikeustunnukset

source: New token
fi: Uusi tunnus

source: Following are personal tokens used to access the %(site_name)s API:
fi: Seuraavat ovat henkilökohtaisia tunnuksia, joilla käytetään %(site_name)s-rajapintaa:

source: You have not yet created any personal access tokens. Click the 'New token' button to create a personal access token.
fi: Et ole vielä luonut henkilökohtaisia käyttöoikeustunnuksia. Luo tunnus napsauttamalla 'Uusi tunnus'.

source: Authorized applications
fi: Valtuutetut sovellukset

source: You have granted the following application access to your account:
fi: Olet myöntänyt seuraavalle sovellukselle pääsyn tiliisi:

source: Revoke
fi: Peruuta

source: You have not yet granted any external applications access to your account.
fi: Et ole vielä myöntänyt yhdellekään ulkoiselle sovellukselle pääsyä tiliisi.

source: New personal access token
fi: Uusi henkilökohtainen käyttöoikeustunnus

source: Create
fi: Luo

source: Authorized application: %(client_name)s
fi: Valtuutettu sovellus: %(client_name)s

source: Personal access token / %(name)s
fi: Henkilökohtainen käyttöoikeustunnus / %(name)s

source: Access token
fi: Käyttöoikeustunnus

source: Please copy the personal access token now. You won't see it again!
fi: Kopioi henkilökohtainen käyttöoikeustunnus nyt. Et näe sitä enää myöhemmin!

source: Do not share this personal access token. It gives full access to your account.
fi: Älä jaa tätä henkilökohtaista käyttöoikeustunnusta. Se antaa täyden pääsyn tiliisi.

source: If you've lost or forgotten this token please create a new one. Be aware that any scripts or applications using this token will need to be updated.
fi: Jos olet kadottanut tai unohtanut tämän tunnuksen, luo uusi. Huomaa, että kaikki tätä tunnusta käyttävät skriptit ja sovellukset on sen jälkeen päivitettävä.

source: Applications
fi: Sovellukset

source: Application settings
fi: Sovelluksen asetukset

source: or
fi: tai

source: Developer applications
fi: Kehittäjäsovellukset
